thtd_exp_table={200,500,900,1400,2000,2700,3500,4400,5400}
thtd_exp_star_table={1,2/3,1/3,1/5,1/15}
-- 总和5400
-- 经验分配规则 保底 1X每只30点 2X每只20点，3X每只10点，4X每只6点，5X每只3点
-- 单吃一个兵经验 300点 200点 100点 60点 30点
-- 经验获取率1X 100% 2X 2/3 3X 1/3 4X 1/5 5X 1/10 
-- 素材培养 （1000+素材卡牌经验/5）* 星级


towerNameList = table.loadkv("scripts/npc/tower.txt")

towerPlayerList = {[1] = {}, [2] = {}, [3] = {},[4] = {}}

-- 这个表是每颗星增加多少属性
-- 前一位数据代表基础属性，后一位数据代表成长属性
thtd_power_table = 
{
	["lily"] = {
		[1] = {50,10},
		[2] = {150,10},
		[3] = {400,10},
		[4] = {1100,10},
		[5] = {4000,10},
	},
	["nazrin"] = {
		[1] = {20,2},
		[2] = {80,4},
		[3] = {200,8},
		[4] = {450,10},
		[5] = {2000,15},
	},
	["mugiyousei"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["shanghainingyou"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["hourainingyou"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["hanadayousei"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["maidyousei"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["cirno"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["kogasa"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["letty"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["lyrica"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["lunasa"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["merlin"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["rumia"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["satori"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},	
	["iku"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["mystia"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["marisa"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["tenshi"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["patchouli"] = {
		[1] = {30,3.0},
		[2] = {100,5.0},
		[3] = {250,6.5},
		[4] = {600,8.0},
		[5] = {2500,15},
	},
	["reisen"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["yuyuko"] = {
		[1] = {40,5.0},
		[2] = {100,6.5},
		[3] = {260,8.0},
		[4] = {560,10.0},
		[5] = {2500,15.0},
	},
	["youmu"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["rin"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["utsuho"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["reimu"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["daiyousei"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["cirno_ex"] = 
	{
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["remilia"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["flandre"] = {
		[1] = {28,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["sakuya"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["koishi"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["koakuma"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["meirin"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["yuuka"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["yukari"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["ran"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["chen"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["eirin"] = {
		[1] = {35,4.0},
		[2] = {130,6},
		[3] = {300,8},
		[4] = {600,10},
		[5] = {2600,20.0},
	},
	["mokou"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["kaguya"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["aya"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["hatate"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["momiji"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["sanae"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["kanako"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["suwako"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["minamitsu"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["nue"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["rumia_ex"] = 
	{
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["toramaru"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["shinki"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["byakuren"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["soga"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["miko"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["futo"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["yoshika"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["seiga"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["keine"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["medicine"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["luna"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["star"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["sunny"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["yuugi"] = 
	{
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["suika"] = 
	{
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["junko"] = {
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["hecatia"] = {
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["alice"] = {
		[1] = {30,3.0},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["kokoro"] = {
		[1] = {30,3.0},
		[2] = {100,5.0},
		[3] = {250,6.5},
		[4] = {600,8.0},
		[5] = {2100,15.0},
	},
	["hina"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},	
	["kagerou"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1900,10},
	},
	["wriggle"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["inaba"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
}

-- 这个表是每颗星增加多少攻击
-- 前一位数据代表基础攻击，后一位数据代表成长攻击

thtd_attack_table = 
{
	["lily"] = {
		[1] = {0,0},
		[2] = {0,0},
		[3] = {0,0},
		[4] = {0,0},
		[5] = {0,0},
	},
	["nazrin"] = {
		[1] = {10,1},
		[2] = {40,2},
		[3] = {100,4},
		[4] = {200,5},
		[5] = {500,6},
	},
	["mugiyousei"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["shanghainingyou"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["hourainingyou"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["hanadayousei"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["maidyousei"] = {
		[1] = {10,2},
		[2] = {55,3},
		[3] = {145,4},
		[4] = {350,6.5},
		[5] = {1400,26},
	},
	["cirno"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["kogasa"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["letty"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["lyrica"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["lunasa"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["merlin"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["rumia"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["satori"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["iku"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["mystia"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["marisa"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["marisa"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["tenshi"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["patchouli"] = {
		[1] = {10,1.0},
		[2] = {50,1.0},
		[3] = {100,1.0},
		[4] = {150,1.0},
		[5] = {500,1.0},
	},
	["reisen"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["yuyuko"] = {
		[1] = {1,1.0},
		[2] = {1,1.0},
		[3] = {1,1.0},
		[4] = {1,1.0},
		[5] = {1,1.0},
	},
	["youmu"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["rin"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["utsuho"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["reimu"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["daiyousei"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["cirno_ex"] = 
	{
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["remilia"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["flandre"] = {
		[1] = {28,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["sakuya"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["koishi"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["koakuma"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["meirin"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["yuuka"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["yukari"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["ran"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["chen"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["eirin"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["mokou"] = {
		[1] = {30,2.5},
		[2] = {105,4.0},
		[3] = {230,5},
		[4] = {450 ,7.0},
		[5] = {2300,12},
	},
	["kaguya"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["aya"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["hatate"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["momiji"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["sanae"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["kanako"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["suwako"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["minamitsu"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["nue"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["rumia_ex"] = 
	{
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["toramaru"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["shinki"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["byakuren"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["soga"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["miko"] = {
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["futo"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["yoshika"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["seiga"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["keine"] = {
		[1] = {20,2.5},
		[2] = {75,4.0},
		[3] = {190,5},
		[4] = {400,7.0},
		[5] = {2000,12},
	},
	["medicine"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["luna"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["star"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["sunny"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["yuugi"] = 
	{
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["suika"] = 
	{
		[1] = {25,3.0},
		[2] = {85,4.5},
		[3] = {220,5},
		[4] = {450,7.5},
		[5] = {2200,15.0},
	},
	["junko"] = {
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["hecatia"] = {
		[1] = {30,3.0},
		[2] = {110,5.0},
		[3] = {300,7.5},
		[4] = {600,10.0},
		[5] = {2400,30.0},
	},
	["alice"] = {
		[1] = {10,1.0},
		[2] = {50,1.0},
		[3] = {100,1.0},
		[4] = {150,1.0},
		[5] = {500,1.0},
	},
	["kokoro"] = {
		[1] = {10,1.0},
		[2] = {50,1.0},
		[3] = {100,1.0},
		[4] = {150,1.0},
		[5] = {500,1.0},
	},
	["hina"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["kagerou"] = {
		[1] = {30,2.5},
		[2] = {105,4.0},
		[3] = {230,5},
		[4] = {450 ,7.0},
		[5] = {2100,12},
	},
	["wriggle"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
	["inaba"] = {
		[1] = {15,2},
		[2] = {60,3.5},
		[3] = {160,5},
		[4] = {375,6.5},
		[5] = {1800,10},
	},
}

-- 这个表是用于解封技能
thtd_ability_table = 
{
	["lily"] = {
		[1] = {["thtd_lily_01"] = 1,["thtd_lily_02"] = 0},
		[2] = {["thtd_lily_01"] = 1,["thtd_lily_02"] = 0},
		[3] = {["thtd_lily_01"] = 1,["thtd_lily_02"] = 0},
		[4] = {["thtd_lily_01"] = 1,["thtd_lily_02"] = 1},
		[5] = {["thtd_lily_01"] = 1,["thtd_lily_02"] = 2},
	},
	["nazrin"] = {
		[1] = {["thtd_nazrin_01"] = 1},
		[2] = {["thtd_nazrin_01"] = 1},
		[3] = {["thtd_nazrin_01"] = 1},
		[4] = {["thtd_nazrin_01"] = 1},
		[5] = {["thtd_nazrin_01"] = 1},
	},
	["minoriko"] = {
		[1] = {["thtd_minoriko_01"] = 1,["thtd_minoriko_02"] = 0},
		[2] = {["thtd_minoriko_01"] = 1,["thtd_minoriko_02"] = 0},
		[3] = {["thtd_minoriko_01"] = 1,["thtd_minoriko_02"] = 1},
		[4] = {["thtd_minoriko_01"] = 1,["thtd_minoriko_02"] = 1},
		[5] = {["thtd_minoriko_01"] = 1,["thtd_minoriko_02"] = 1},
	},
	["mugiyousei"] = {
		[1] = {["thtd_mugiyousei_01"] = 1},
		[2] = {["thtd_mugiyousei_01"] = 1},
		[3] = {["thtd_mugiyousei_01"] = 1},
		[4] = {["thtd_mugiyousei_01"] = 1},
		[5] = {["thtd_mugiyousei_01"] = 1},
	},
	["shanghainingyou"] = {
		[1] = {["thtd_shanghainingyou_01"] = 1},
		[2] = {["thtd_shanghainingyou_01"] = 1},
		[3] = {["thtd_shanghainingyou_01"] = 1},
		[4] = {["thtd_shanghainingyou_01"] = 1},
		[5] = {["thtd_shanghainingyou_01"] = 1},
	},
	["hourainingyou"] = {
		[1] = {["thtd_hourainingyou_01"] = 1},
		[2] = {["thtd_hourainingyou_01"] = 1},
		[3] = {["thtd_hourainingyou_01"] = 1},
		[4] = {["thtd_hourainingyou_01"] = 1},
		[5] = {["thtd_hourainingyou_01"] = 1},
	},
	["hanadayousei"] = {
		[1] = {["thtd_hanadayousei_01"] = 1},
		[2] = {["thtd_hanadayousei_01"] = 1},
		[3] = {["thtd_hanadayousei_01"] = 1},
		[4] = {["thtd_hanadayousei_01"] = 1},
		[5] = {["thtd_hanadayousei_01"] = 1},
	},
	["maidyousei"] = {
		[1] = {["luna_moon_glaive"] = 1},
		[2] = {["luna_moon_glaive"] = 1},
		[3] = {["luna_moon_glaive"] = 1},
		[4] = {["luna_moon_glaive"] = 1},
		[5] = {["luna_moon_glaive"] = 1},
	},
	["cirno"] = {
		[1] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 0,["thtd_cirno_03"] = 0,["thtd_cirno_04"] = 0},
		[2] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 0,["thtd_cirno_03"] = 0,["thtd_cirno_04"] = 0},
		[3] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 0,["thtd_cirno_03"] = 0,["thtd_cirno_04"] = 0},
		[4] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 1,["thtd_cirno_03"] = 0,["thtd_cirno_04"] = 0},
		[5] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 1,["thtd_cirno_03"] = 0,["thtd_cirno_04"] = 0},
	},
	["letty"] = {
		[1] = {["thtd_letty_01"] = 1,["thtd_letty_02"] = 0},
		[2] = {["thtd_letty_01"] = 1,["thtd_letty_02"] = 0},
		[3] = {["thtd_letty_01"] = 1,["thtd_letty_02"] = 1},
		[4] = {["thtd_letty_01"] = 1,["thtd_letty_02"] = 2},
		[5] = {["thtd_letty_01"] = 1,["thtd_letty_02"] = 3},
	},
	["kogasa"] = {
		[1] = {["thtd_kogasa_01"] = 1,["thtd_kogasa_02"] = 0},
		[2] = {["thtd_kogasa_01"] = 1,["thtd_kogasa_02"] = 0},
		[3] = {["thtd_kogasa_01"] = 1,["thtd_kogasa_02"] = 1},
		[4] = {["thtd_kogasa_01"] = 1,["thtd_kogasa_02"] = 2},
		[5] = {["thtd_kogasa_01"] = 1,["thtd_kogasa_02"] = 3},
	},
	["lyrica"] = {
		[1] = {["thtd_lyrica_01"] = 1,["thtd_lyrica_02"] = 0},
		[2] = {["thtd_lyrica_01"] = 1,["thtd_lyrica_02"] = 0},
		[3] = {["thtd_lyrica_01"] = 1,["thtd_lyrica_02"] = 1},
		[4] = {["thtd_lyrica_01"] = 1,["thtd_lyrica_02"] = 1},
		[5] = {["thtd_lyrica_01"] = 1,["thtd_lyrica_02"] = 1},
	},
	["lunasa"] = {
		[1] = {["thtd_lunasa_01"] = 1,["thtd_lunasa_02"] = 0},
		[2] = {["thtd_lunasa_01"] = 1,["thtd_lunasa_02"] = 0},
		[3] = {["thtd_lunasa_01"] = 1,["thtd_lunasa_02"] = 1},
		[4] = {["thtd_lunasa_01"] = 1,["thtd_lunasa_02"] = 1},
		[5] = {["thtd_lunasa_01"] = 1,["thtd_lunasa_02"] = 1},
	},
	["merlin"] = {
		[1] = {["thtd_merlin_01"] = 1,["thtd_merlin_02"] = 0},
		[2] = {["thtd_merlin_01"] = 2,["thtd_merlin_02"] = 0},
		[3] = {["thtd_merlin_01"] = 3,["thtd_merlin_02"] = 1},
		[4] = {["thtd_merlin_01"] = 4,["thtd_merlin_02"] = 1},
		[5] = {["thtd_merlin_01"] = 5,["thtd_merlin_02"] = 1},
	},
	["rumia"] = {
		[1] = {["thtd_rumia_01"] = 1,["thtd_rumia_02"] = 0,["thtd_rumia_03"] = 0,["thtd_rumia_04"] = 0},
		[2] = {["thtd_rumia_01"] = 2,["thtd_rumia_02"] = 0,["thtd_rumia_03"] = 0,["thtd_rumia_04"] = 0},
		[3] = {["thtd_rumia_01"] = 3,["thtd_rumia_02"] = 1,["thtd_rumia_03"] = 0,["thtd_rumia_04"] = 0},
		[4] = {["thtd_rumia_01"] = 4,["thtd_rumia_02"] = 1,["thtd_rumia_03"] = 0,["thtd_rumia_04"] = 0},
		[5] = {["thtd_rumia_01"] = 5,["thtd_rumia_02"] = 1,["thtd_rumia_03"] = 0,["thtd_rumia_04"] = 0},
	},
	["satori"] = {
		[1] = {["thtd_satori_01"] = 1,["thtd_satori_02"] = 0},
		[2] = {["thtd_satori_01"] = 2,["thtd_satori_02"] = 0},
		[3] = {["thtd_satori_01"] = 3,["thtd_satori_02"] = 0},
		[4] = {["thtd_satori_01"] = 4,["thtd_satori_02"] = 1},
		[5] = {["thtd_satori_01"] = 5,["thtd_satori_02"] = 1},
	},
	["iku"] = {
		[1] = {["thtd_iku_01"] = 1,["thtd_iku_02"] = 0},
		[2] = {["thtd_iku_01"] = 2,["thtd_iku_02"] = 0},
		[3] = {["thtd_iku_01"] = 3,["thtd_iku_02"] = 0},
		[4] = {["thtd_iku_01"] = 4,["thtd_iku_02"] = 1},
		[5] = {["thtd_iku_01"] = 5,["thtd_iku_02"] = 1},
	},
	["mystia"] = {
		[1] = {["thtd_mystia_01"] = 1,["thtd_mystia_02"] = 0},
		[2] = {["thtd_mystia_01"] = 2,["thtd_mystia_02"] = 0},
		[3] = {["thtd_mystia_01"] = 3,["thtd_mystia_02"] = 1},
		[4] = {["thtd_mystia_01"] = 4,["thtd_mystia_02"] = 2},
		[5] = {["thtd_mystia_01"] = 5,["thtd_mystia_02"] = 3},
	},
	["marisa"] = {
		[1] = {["thtd_marisa_01"] = 1,["thtd_marisa_02"] = 1,["thtd_marisa_03"] = 0},
		[2] = {["thtd_marisa_01"] = 1,["thtd_marisa_02"] = 1,["thtd_marisa_03"] = 0},
		[3] = {["thtd_marisa_01"] = 1,["thtd_marisa_02"] = 1,["thtd_marisa_03"] = 0},
		[4] = {["thtd_marisa_01"] = 1,["thtd_marisa_02"] = 1,["thtd_marisa_03"] = 1},
		[5] = {["thtd_marisa_01"] = 1,["thtd_marisa_02"] = 1,["thtd_marisa_03"] = 1},
	},
	["tenshi"] = {
		[1] = {["thtd_tenshi_01"] = 1,["thtd_tenshi_02"] = 1,["thtd_tenshi_03"] = 0},
		[2] = {["thtd_tenshi_01"] = 1,["thtd_tenshi_02"] = 1,["thtd_tenshi_03"] = 0},
		[3] = {["thtd_tenshi_01"] = 1,["thtd_tenshi_02"] = 1,["thtd_tenshi_03"] = 0},
		[4] = {["thtd_tenshi_01"] = 1,["thtd_tenshi_02"] = 1,["thtd_tenshi_03"] = 1},
		[5] = {["thtd_tenshi_01"] = 1,["thtd_tenshi_02"] = 1,["thtd_tenshi_03"] = 1},
	},
	["patchouli"] = {
		[1] = {["thtd_patchouli_01"] = 1,["thtd_patchouli_02"] = 1,["thtd_patchouli_03"] = 0},
		[2] = {["thtd_patchouli_01"] = 2,["thtd_patchouli_02"] = 1,["thtd_patchouli_03"] = 0},
		[3] = {["thtd_patchouli_01"] = 3,["thtd_patchouli_02"] = 1,["thtd_patchouli_03"] = 1},
		[4] = {["thtd_patchouli_01"] = 4,["thtd_patchouli_02"] = 1,["thtd_patchouli_03"] = 1},
		[5] = {["thtd_patchouli_01"] = 5,["thtd_patchouli_02"] = 1,["thtd_patchouli_03"] = 1},
	},
	["reisen"] = {
		[1] = {["thtd_reisen_01"] = 1,["thtd_reisen_02"] = 1,["thtd_reisen_03"] = 0},
		[2] = {["thtd_reisen_01"] = 2,["thtd_reisen_02"] = 1,["thtd_reisen_03"] = 0},
		[3] = {["thtd_reisen_01"] = 3,["thtd_reisen_02"] = 1,["thtd_reisen_03"] = 0},
		[4] = {["thtd_reisen_01"] = 4,["thtd_reisen_02"] = 1,["thtd_reisen_03"] = 1},
		[5] = {["thtd_reisen_01"] = 5,["thtd_reisen_02"] = 1,["thtd_reisen_03"] = 1},
	},
	["yuyuko"] = {
		[1] = {["thtd_yuyuko_01"] = 1,["thtd_yuyuko_02"] = 1,["thtd_yuyuko_03"] = 0},
		[2] = {["thtd_yuyuko_01"] = 2,["thtd_yuyuko_02"] = 1,["thtd_yuyuko_03"] = 0},
		[3] = {["thtd_yuyuko_01"] = 3,["thtd_yuyuko_02"] = 1,["thtd_yuyuko_03"] = 0},
		[4] = {["thtd_yuyuko_01"] = 4,["thtd_yuyuko_02"] = 1,["thtd_yuyuko_03"] = 1},
		[5] = {["thtd_yuyuko_01"] = 5,["thtd_yuyuko_02"] = 1,["thtd_yuyuko_03"] = 1},
	},
	["youmu"] = {
		[1] = {["thtd_youmu_01"] = 1,["thtd_youmu_02"] = 1,["thtd_youmu_03"] = 0},
		[2] = {["thtd_youmu_01"] = 1,["thtd_youmu_02"] = 1,["thtd_youmu_03"] = 0},
		[3] = {["thtd_youmu_01"] = 1,["thtd_youmu_02"] = 1,["thtd_youmu_03"] = 0},
		[4] = {["thtd_youmu_01"] = 1,["thtd_youmu_02"] = 1,["thtd_youmu_03"] = 1},
		[5] = {["thtd_youmu_01"] = 1,["thtd_youmu_02"] = 1,["thtd_youmu_03"] = 1},
	},
	["rin"] = {
		[1] = {["thtd_rin_01"] = 1,["thtd_rin_02"] = 0,},
		[2] = {["thtd_rin_01"] = 1,["thtd_rin_02"] = 0,},
		[3] = {["thtd_rin_01"] = 1,["thtd_rin_02"] = 1,},
		[4] = {["thtd_rin_01"] = 1,["thtd_rin_02"] = 1,},
		[5] = {["thtd_rin_01"] = 1,["thtd_rin_02"] = 1,},
	},
	["utsuho"] = {
		[1] = {["thtd_utsuho_01"] = 1,["thtd_utsuho_02"] = 1,["thtd_utsuho_03"] = 0,},
		[2] = {["thtd_utsuho_01"] = 1,["thtd_utsuho_02"] = 1,["thtd_utsuho_03"] = 0,},
		[3] = {["thtd_utsuho_01"] = 1,["thtd_utsuho_02"] = 1,["thtd_utsuho_03"] = 0,},
		[4] = {["thtd_utsuho_01"] = 1,["thtd_utsuho_02"] = 1,["thtd_utsuho_03"] = 1,},
		[5] = {["thtd_utsuho_01"] = 1,["thtd_utsuho_02"] = 1,["thtd_utsuho_03"] = 2,},
	},
	["reimu"] = {
		[1] = {["thtd_reimu_01"] = 1,["thtd_reimu_02"] = 1,["thtd_reimu_03"] = 0,["thtd_reimu_04"] = 0},
		[2] = {["thtd_reimu_01"] = 1,["thtd_reimu_02"] = 1,["thtd_reimu_03"] = 0,["thtd_reimu_04"] = 0},
		[3] = {["thtd_reimu_01"] = 1,["thtd_reimu_02"] = 1,["thtd_reimu_03"] = 1,["thtd_reimu_04"] = 0},
		[4] = {["thtd_reimu_01"] = 1,["thtd_reimu_02"] = 1,["thtd_reimu_03"] = 1,["thtd_reimu_04"] = 0},
		[5] = {["thtd_reimu_01"] = 1,["thtd_reimu_02"] = 1,["thtd_reimu_03"] = 1,["thtd_reimu_04"] = 1},
	},
	["daiyousei"] = {
		[1] = {["thtd_daiyousei_01"] = 1,["thtd_daiyousei_02"] = 1,["thtd_daiyousei_03"] = 0,["thtd_daiyousei_04"] = 0},
		[2] = {["thtd_daiyousei_01"] = 1,["thtd_daiyousei_02"] = 1,["thtd_daiyousei_03"] = 0,["thtd_daiyousei_04"] = 0},
		[3] = {["thtd_daiyousei_01"] = 1,["thtd_daiyousei_02"] = 1,["thtd_daiyousei_03"] = 1,["thtd_daiyousei_04"] = 0},
		[4] = {["thtd_daiyousei_01"] = 1,["thtd_daiyousei_02"] = 1,["thtd_daiyousei_03"] = 1,["thtd_daiyousei_04"] = 0},
		[5] = {["thtd_daiyousei_01"] = 1,["thtd_daiyousei_02"] = 1,["thtd_daiyousei_03"] = 1,["thtd_daiyousei_04"] = 1},
	},
	["cirno_ex"] = 
	{
		[1] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 0,["thtd_cirno_03"] = 0,["thtd_cirno_04"] = 0},
		[2] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 0,["thtd_cirno_03"] = 0,["thtd_cirno_04"] = 0},
		[3] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 0,["thtd_cirno_03"] = 1,["thtd_cirno_04"] = 0},
		[4] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 1,["thtd_cirno_03"] = 1,["thtd_cirno_04"] = 0},
		[5] = {["thtd_cirno_01"] = 1,["thtd_cirno_02"] = 1,["thtd_cirno_03"] = 1,["thtd_cirno_04"] = 1},
	},
	["remilia"] = 
	{
		[1] = {["thtd_remilia_01"] = 1,["thtd_remilia_02"] = 1,["thtd_remilia_03"] = 0,["thtd_remilia_04"] = 0},
		[2] = {["thtd_remilia_01"] = 1,["thtd_remilia_02"] = 1,["thtd_remilia_03"] = 0,["thtd_remilia_04"] = 0},
		[3] = {["thtd_remilia_01"] = 1,["thtd_remilia_02"] = 1,["thtd_remilia_03"] = 1,["thtd_remilia_04"] = 0},
		[4] = {["thtd_remilia_01"] = 1,["thtd_remilia_02"] = 1,["thtd_remilia_03"] = 1,["thtd_remilia_04"] = 0},
		[5] = {["thtd_remilia_01"] = 1,["thtd_remilia_02"] = 1,["thtd_remilia_03"] = 1,["thtd_remilia_04"] = 1},
	},
	["flandre"] = 
	{
		[1] = {["thtd_flandre_01"] = 1,["thtd_flandre_02"] = 1,["thtd_flandre_03"] = 0,["thtd_flandre_04"] = 0},
		[2] = {["thtd_flandre_01"] = 1,["thtd_flandre_02"] = 1,["thtd_flandre_03"] = 0,["thtd_flandre_04"] = 0},
		[3] = {["thtd_flandre_01"] = 1,["thtd_flandre_02"] = 1,["thtd_flandre_03"] = 1,["thtd_flandre_04"] = 0},
		[4] = {["thtd_flandre_01"] = 1,["thtd_flandre_02"] = 1,["thtd_flandre_03"] = 1,["thtd_flandre_04"] = 0},
		[5] = {["thtd_flandre_01"] = 1,["thtd_flandre_02"] = 1,["thtd_flandre_03"] = 1,["thtd_flandre_04"] = 1},
	},
	["sakuya"] = 
	{
		[1] = {["thtd_sakuya_01"] = 1,["thtd_sakuya_02"] = 0,["thtd_sakuya_03"] = 0},
		[2] = {["thtd_sakuya_01"] = 1,["thtd_sakuya_02"] = 0,["thtd_sakuya_03"] = 0},
		[3] = {["thtd_sakuya_01"] = 1,["thtd_sakuya_02"] = 1,["thtd_sakuya_03"] = 0},
		[4] = {["thtd_sakuya_01"] = 1,["thtd_sakuya_02"] = 1,["thtd_sakuya_03"] = 1},
		[5] = {["thtd_sakuya_01"] = 1,["thtd_sakuya_02"] = 1,["thtd_sakuya_03"] = 1},
	},
	["koishi"] = 
	{
		[1] = {["thtd_koishi_01"] = 1,["thtd_koishi_02"] = 1,["thtd_koishi_03"] = 0,["thtd_koishi_04"] = 0},
		[2] = {["thtd_koishi_01"] = 1,["thtd_koishi_02"] = 1,["thtd_koishi_03"] = 0,["thtd_koishi_04"] = 0},
		[3] = {["thtd_koishi_01"] = 1,["thtd_koishi_02"] = 1,["thtd_koishi_03"] = 1,["thtd_koishi_04"] = 0},
		[4] = {["thtd_koishi_01"] = 1,["thtd_koishi_02"] = 1,["thtd_koishi_03"] = 1,["thtd_koishi_04"] = 0},
		[5] = {["thtd_koishi_01"] = 1,["thtd_koishi_02"] = 1,["thtd_koishi_03"] = 1,["thtd_koishi_04"] = 1},
	},
	["koakuma"] = 
	{
		[1] = {["thtd_koakuma_01"] = 1,["thtd_koakuma_02"] = 0},
		[2] = {["thtd_koakuma_01"] = 1,["thtd_koakuma_02"] = 0},
		[3] = {["thtd_koakuma_01"] = 1,["thtd_koakuma_02"] = 1},
		[4] = {["thtd_koakuma_01"] = 1,["thtd_koakuma_02"] = 2},
		[5] = {["thtd_koakuma_01"] = 1,["thtd_koakuma_02"] = 3},
	},
	["meirin"] = 
	{
		[1] = {["thtd_meirin_01"] = 1,["thtd_meirin_02"] = 1},
		[2] = {["thtd_meirin_01"] = 1,["thtd_meirin_02"] = 1},
		[3] = {["thtd_meirin_01"] = 1,["thtd_meirin_02"] = 3},
		[4] = {["thtd_meirin_01"] = 1,["thtd_meirin_02"] = 3},
		[5] = {["thtd_meirin_01"] = 1,["thtd_meirin_02"] = 5},
	},
	["yuuka"] = 
	{
		[1] = {["thtd_yuuka_01"] = 1,["thtd_yuuka_02"] = 1,["thtd_yuuka_03"] = 0,["thtd_yuuka_04"] = 0},
		[2] = {["thtd_yuuka_01"] = 1,["thtd_yuuka_02"] = 1,["thtd_yuuka_03"] = 0,["thtd_yuuka_04"] = 0},
		[3] = {["thtd_yuuka_01"] = 1,["thtd_yuuka_02"] = 1,["thtd_yuuka_03"] = 1,["thtd_yuuka_04"] = 0},
		[4] = {["thtd_yuuka_01"] = 1,["thtd_yuuka_02"] = 1,["thtd_yuuka_03"] = 1,["thtd_yuuka_04"] = 0},
		[5] = {["thtd_yuuka_01"] = 1,["thtd_yuuka_02"] = 1,["thtd_yuuka_03"] = 1,["thtd_yuuka_04"] = 1},
	},
	["yukari"] = 
	{
		[1] = {["thtd_yukari_01"] = 1,["thtd_yukari_02"] = 1,["thtd_yukari_03"] = 0,["thtd_yukari_04"] = 0},
		[2] = {["thtd_yukari_01"] = 1,["thtd_yukari_02"] = 1,["thtd_yukari_03"] = 0,["thtd_yukari_04"] = 0},
		[3] = {["thtd_yukari_01"] = 1,["thtd_yukari_02"] = 1,["thtd_yukari_03"] = 1,["thtd_yukari_04"] = 0},
		[4] = {["thtd_yukari_01"] = 1,["thtd_yukari_02"] = 1,["thtd_yukari_03"] = 1,["thtd_yukari_04"] = 0},
		[5] = {["thtd_yukari_01"] = 1,["thtd_yukari_02"] = 1,["thtd_yukari_03"] = 1,["thtd_yukari_04"] = 1},
	},
	["ran"] = 
	{
		[1] = {["thtd_ran_01"] = 1,["thtd_ran_02"] = 1,["thtd_ran_03"] = 0},
		[2] = {["thtd_ran_01"] = 1,["thtd_ran_02"] = 2,["thtd_ran_03"] = 0},
		[3] = {["thtd_ran_01"] = 1,["thtd_ran_02"] = 3,["thtd_ran_03"] = 0},
		[4] = {["thtd_ran_01"] = 1,["thtd_ran_02"] = 4,["thtd_ran_03"] = 1},
		[5] = {["thtd_ran_01"] = 1,["thtd_ran_02"] = 5,["thtd_ran_03"] = 1},
	},
	["chen"] = 
	{
		[1] = {["thtd_chen_01"] = 1},
		[2] = {["thtd_chen_01"] = 2},
		[3] = {["thtd_chen_01"] = 3},
		[4] = {["thtd_chen_01"] = 4},
		[5] = {["thtd_chen_01"] = 5},
	},
	["eirin"] = 
	{
		[1] = {["thtd_eirin_01"] = 1,["thtd_eirin_02"] = 1,["thtd_eirin_03"] = 0,["thtd_eirin_04"] = 0},
		[2] = {["thtd_eirin_01"] = 1,["thtd_eirin_02"] = 1,["thtd_eirin_03"] = 0,["thtd_eirin_04"] = 0},
		[3] = {["thtd_eirin_01"] = 1,["thtd_eirin_02"] = 1,["thtd_eirin_03"] = 1,["thtd_eirin_04"] = 0},
		[4] = {["thtd_eirin_01"] = 1,["thtd_eirin_02"] = 1,["thtd_eirin_03"] = 1,["thtd_eirin_04"] = 0},
		[5] = {["thtd_eirin_01"] = 1,["thtd_eirin_02"] = 1,["thtd_eirin_03"] = 1,["thtd_eirin_04"] = 1},
	},
	["mokou"] = 
	{
		[1] = {["thtd_mokou_01"] = 1,["thtd_mokou_02"] = 1,["thtd_mokou_03"] = 0},
		[2] = {["thtd_mokou_01"] = 1,["thtd_mokou_02"] = 1,["thtd_mokou_03"] = 0},
		[3] = {["thtd_mokou_01"] = 1,["thtd_mokou_02"] = 1,["thtd_mokou_03"] = 0},
		[4] = {["thtd_mokou_01"] = 1,["thtd_mokou_02"] = 1,["thtd_mokou_03"] = 1},
		[5] = {["thtd_mokou_01"] = 1,["thtd_mokou_02"] = 1,["thtd_mokou_03"] = 1},
	},
	["kaguya"] = 
	{
		[1] = {["thtd_kaguya_01"] = 1,["thtd_kaguya_02"] = 1,["thtd_kaguya_03"] = 0},
		[2] = {["thtd_kaguya_01"] = 1,["thtd_kaguya_02"] = 2,["thtd_kaguya_03"] = 0},
		[3] = {["thtd_kaguya_01"] = 1,["thtd_kaguya_02"] = 3,["thtd_kaguya_03"] = 0},
		[4] = {["thtd_kaguya_01"] = 1,["thtd_kaguya_02"] = 4,["thtd_kaguya_03"] = 1},
		[5] = {["thtd_kaguya_01"] = 1,["thtd_kaguya_02"] = 5,["thtd_kaguya_03"] = 2},
	},

	["aya"] = 
	{
		[1] = {["thtd_aya_01"] = 1,["thtd_aya_02"] = 0,["thtd_aya_03"] = 0},
		[2] = {["thtd_aya_01"] = 1,["thtd_aya_02"] = 0,["thtd_aya_03"] = 0},
		[3] = {["thtd_aya_01"] = 1,["thtd_aya_02"] = 0,["thtd_aya_03"] = 0},
		[4] = {["thtd_aya_01"] = 1,["thtd_aya_02"] = 1,["thtd_aya_03"] = 1},
		[5] = {["thtd_aya_01"] = 1,["thtd_aya_02"] = 1,["thtd_aya_03"] = 1},
	},

	["hatate"] = 
	{
		[1] = {["thtd_hatate_01"] = 1,["thtd_hatate_02"] = 0},
		[2] = {["thtd_hatate_01"] = 1,["thtd_hatate_02"] = 0},
		[3] = {["thtd_hatate_01"] = 1,["thtd_hatate_02"] = 0},
		[4] = {["thtd_hatate_01"] = 1,["thtd_hatate_02"] = 1},
		[5] = {["thtd_hatate_01"] = 1,["thtd_hatate_02"] = 1},
	},

	["momiji"] = 
	{
		[1] = {["thtd_momiji_01"] = 1,["thtd_momiji_02"] = 0},
		[2] = {["thtd_momiji_01"] = 1,["thtd_momiji_02"] = 0},
		[3] = {["thtd_momiji_01"] = 1,["thtd_momiji_02"] = 1},
		[4] = {["thtd_momiji_01"] = 1,["thtd_momiji_02"] = 1},
		[5] = {["thtd_momiji_01"] = 1,["thtd_momiji_02"] = 1},
	},

	["sanae"] = 
	{
		[1] = {["thtd_sanae_01"] = 1,["thtd_sanae_02"] = 1,["thtd_sanae_03"] = 0,["thtd_sanae_04"] = 0},
		[2] = {["thtd_sanae_01"] = 1,["thtd_sanae_02"] = 2,["thtd_sanae_03"] = 0,["thtd_sanae_04"] = 0},
		[3] = {["thtd_sanae_01"] = 1,["thtd_sanae_02"] = 3,["thtd_sanae_03"] = 0,["thtd_sanae_04"] = 0},
		[4] = {["thtd_sanae_01"] = 1,["thtd_sanae_02"] = 4,["thtd_sanae_03"] = 1,["thtd_sanae_04"] = 0},
		[5] = {["thtd_sanae_01"] = 1,["thtd_sanae_02"] = 5,["thtd_sanae_03"] = 1,["thtd_sanae_04"] = 0},
	},

	["kanako"] = 
	{
		[1] = {["thtd_kanako_01"] = 1,["thtd_kanako_02"] = 0,["thtd_kanako_03"] = 0,["thtd_kanako_04"] = 0},
		[2] = {["thtd_kanako_01"] = 1,["thtd_kanako_02"] = 0,["thtd_kanako_03"] = 0,["thtd_kanako_04"] = 0},
		[3] = {["thtd_kanako_01"] = 1,["thtd_kanako_02"] = 1,["thtd_kanako_03"] = 1,["thtd_kanako_04"] = 0},
		[4] = {["thtd_kanako_01"] = 1,["thtd_kanako_02"] = 1,["thtd_kanako_03"] = 1,["thtd_kanako_04"] = 0},
		[5] = {["thtd_kanako_01"] = 1,["thtd_kanako_02"] = 1,["thtd_kanako_03"] = 1,["thtd_kanako_04"] = 1},
	},

	["suwako"] = 
	{
		[1] = {["thtd_suwako_01"] = 1,["thtd_suwako_02"] = 0,["thtd_suwako_03"] = 0,["thtd_suwako_04"] = 0},
		[2] = {["thtd_suwako_01"] = 1,["thtd_suwako_02"] = 0,["thtd_suwako_03"] = 0,["thtd_suwako_04"] = 0},
		[3] = {["thtd_suwako_01"] = 1,["thtd_suwako_02"] = 1,["thtd_suwako_03"] = 0,["thtd_suwako_04"] = 0},
		[4] = {["thtd_suwako_01"] = 1,["thtd_suwako_02"] = 1,["thtd_suwako_03"] = 1,["thtd_suwako_04"] = 0},
		[5] = {["thtd_suwako_01"] = 1,["thtd_suwako_02"] = 1,["thtd_suwako_03"] = 1,["thtd_suwako_04"] = 1},
	},

	["minamitsu"] = 
	{
		[1] = {["thtd_minamitsu_01"] = 1,["thtd_minamitsu_02"] = 1,["thtd_minamitsu_03"] = 0,["thtd_minamitsu_04"] = 0},
		[2] = {["thtd_minamitsu_01"] = 2,["thtd_minamitsu_02"] = 1,["thtd_minamitsu_03"] = 0,["thtd_minamitsu_04"] = 0},
		[3] = {["thtd_minamitsu_01"] = 3,["thtd_minamitsu_02"] = 1,["thtd_minamitsu_03"] = 0,["thtd_minamitsu_04"] = 0},
		[4] = {["thtd_minamitsu_01"] = 4,["thtd_minamitsu_02"] = 1,["thtd_minamitsu_03"] = 1,["thtd_minamitsu_04"] = 0},
		[5] = {["thtd_minamitsu_01"] = 5,["thtd_minamitsu_02"] = 1,["thtd_minamitsu_03"] = 1,["thtd_minamitsu_04"] = 1},
	},

	["nue"] = 
	{
		[1] = {["thtd_nue_01"] = 1,["thtd_nue_02"] = 0,["thtd_nue_03"] = 0},
		[2] = {["thtd_nue_01"] = 1,["thtd_nue_02"] = 0,["thtd_nue_03"] = 0},
		[3] = {["thtd_nue_01"] = 1,["thtd_nue_02"] = 1,["thtd_nue_03"] = 0},
		[4] = {["thtd_nue_01"] = 1,["thtd_nue_02"] = 1,["thtd_nue_03"] = 1},
		[5] = {["thtd_nue_01"] = 1,["thtd_nue_02"] = 1,["thtd_nue_03"] = 1},
	},

	["rumia_ex"] = 
	{
		[1] = {["thtd_rumia_01"] = 1,["thtd_rumia_02"] = 0,["thtd_rumia_03"] = 0,["thtd_rumia_04"] = 0},
		[2] = {["thtd_rumia_01"] = 2,["thtd_rumia_02"] = 0,["thtd_rumia_03"] = 0,["thtd_rumia_04"] = 0},
		[3] = {["thtd_rumia_01"] = 3,["thtd_rumia_02"] = 1,["thtd_rumia_03"] = 0,["thtd_rumia_04"] = 0},
		[4] = {["thtd_rumia_01"] = 4,["thtd_rumia_02"] = 1,["thtd_rumia_03"] = 1,["thtd_rumia_04"] = 0},
		[5] = {["thtd_rumia_01"] = 5,["thtd_rumia_02"] = 1,["thtd_rumia_03"] = 1,["thtd_rumia_04"] = 1},
	},

	["sizuha"] = {
		[1] = {["thtd_sizuha_01"] = 1,["thtd_sizuha_02"] = 0},
		[2] = {["thtd_sizuha_01"] = 1,["thtd_sizuha_02"] = 1},
		[3] = {["thtd_sizuha_01"] = 1,["thtd_sizuha_02"] = 1},
		[4] = {["thtd_sizuha_01"] = 1,["thtd_sizuha_02"] = 1},
		[5] = {["thtd_sizuha_01"] = 1,["thtd_sizuha_02"] = 1},
	},

	["toramaru"] = {
		[1] = {["thtd_toramaru_01"] = 1,["thtd_toramaru_02"] = 0,["thtd_toramaru_03"] = 0,["thtd_toramaru_04"] = 0},
		[2] = {["thtd_toramaru_01"] = 1,["thtd_toramaru_02"] = 0,["thtd_toramaru_03"] = 0,["thtd_toramaru_04"] = 0},
		[3] = {["thtd_toramaru_01"] = 1,["thtd_toramaru_02"] = 1,["thtd_toramaru_03"] = 0,["thtd_toramaru_04"] = 1},
		[4] = {["thtd_toramaru_01"] = 1,["thtd_toramaru_02"] = 1,["thtd_toramaru_03"] = 0,["thtd_toramaru_04"] = 1},
		[5] = {["thtd_toramaru_01"] = 1,["thtd_toramaru_02"] = 1,["thtd_toramaru_03"] = 1,["thtd_toramaru_04"] = 1},
	},

	["shinki"] = {
		[1] = {["thtd_shinki_01"] = 1,["thtd_shinki_02"] = 1,["thtd_shinki_03"] = 0,["thtd_shinki_04"] = 0},
		[2] = {["thtd_shinki_01"] = 1,["thtd_shinki_02"] = 1,["thtd_shinki_03"] = 0,["thtd_shinki_04"] = 0},
		[3] = {["thtd_shinki_01"] = 1,["thtd_shinki_02"] = 1,["thtd_shinki_03"] = 0,["thtd_shinki_04"] = 0},
		[4] = {["thtd_shinki_01"] = 1,["thtd_shinki_02"] = 1,["thtd_shinki_03"] = 0,["thtd_shinki_04"] = 1},
		[5] = {["thtd_shinki_01"] = 1,["thtd_shinki_02"] = 1,["thtd_shinki_03"] = 1,["thtd_shinki_04"] = 1},
	},

	["byakuren"] = {
		[1] = {["thtd_byakuren_01"] = 1,["thtd_byakuren_02"] = 1,["thtd_byakuren_03"] = 0,["thtd_byakuren_04"] = 0},
		[2] = {["thtd_byakuren_01"] = 1,["thtd_byakuren_02"] = 1,["thtd_byakuren_03"] = 0,["thtd_byakuren_04"] = 0},
		[3] = {["thtd_byakuren_01"] = 1,["thtd_byakuren_02"] = 1,["thtd_byakuren_03"] = 1,["thtd_byakuren_04"] = 0},
		[4] = {["thtd_byakuren_01"] = 1,["thtd_byakuren_02"] = 1,["thtd_byakuren_03"] = 1,["thtd_byakuren_04"] = 0},
		[5] = {["thtd_byakuren_01"] = 1,["thtd_byakuren_02"] = 1,["thtd_byakuren_03"] = 1,["thtd_byakuren_04"] = 1},
	},

	["soga"] = {
		[1] = {["thtd_soga_01"] = 1,["thtd_soga_02"] = 0,["thtd_soga_03"] = 0},
		[2] = {["thtd_soga_01"] = 1,["thtd_soga_02"] = 0,["thtd_soga_03"] = 0},
		[3] = {["thtd_soga_01"] = 1,["thtd_soga_02"] = 1,["thtd_soga_03"] = 0},
		[4] = {["thtd_soga_01"] = 1,["thtd_soga_02"] = 1,["thtd_soga_03"] = 1},
		[5] = {["thtd_soga_01"] = 1,["thtd_soga_02"] = 1,["thtd_soga_03"] = 1},
	},

	["miko"] = {
		[1] = {["thtd_miko_01"] = 1,["thtd_miko_02"] = 1,["thtd_miko_03"] = 0,["thtd_miko_04"] = 0},
		[2] = {["thtd_miko_01"] = 1,["thtd_miko_02"] = 1,["thtd_miko_03"] = 0,["thtd_miko_04"] = 0},
		[3] = {["thtd_miko_01"] = 1,["thtd_miko_02"] = 1,["thtd_miko_03"] = 1,["thtd_miko_04"] = 0},
		[4] = {["thtd_miko_01"] = 1,["thtd_miko_02"] = 1,["thtd_miko_03"] = 1,["thtd_miko_04"] = 0},
		[5] = {["thtd_miko_01"] = 1,["thtd_miko_02"] = 1,["thtd_miko_03"] = 1,["thtd_miko_04"] = 1},
	},

	["futo"] = {
		[1] = {["thtd_futo_01"] = 1,["thtd_futo_02"] = 0,["thtd_futo_03"] = 0},
		[2] = {["thtd_futo_01"] = 1,["thtd_futo_02"] = 0,["thtd_futo_03"] = 0},
		[3] = {["thtd_futo_01"] = 1,["thtd_futo_02"] = 1,["thtd_futo_03"] = 0},
		[4] = {["thtd_futo_01"] = 1,["thtd_futo_02"] = 1,["thtd_futo_03"] = 1},
		[5] = {["thtd_futo_01"] = 1,["thtd_futo_02"] = 1,["thtd_futo_03"] = 1},
	},

	["yoshika"] = {
		[1] = {["thtd_yoshika_01"] = 1,["thtd_yoshika_02"] = 0},
		[2] = {["thtd_yoshika_01"] = 2,["thtd_yoshika_02"] = 0},
		[3] = {["thtd_yoshika_01"] = 3,["thtd_yoshika_02"] = 1},
		[4] = {["thtd_yoshika_01"] = 4,["thtd_yoshika_02"] = 1},
		[5] = {["thtd_yoshika_01"] = 5,["thtd_yoshika_02"] = 1},
	},

	["seiga"] = {
		[1] = {["thtd_seiga_01"] = 1,["thtd_seiga_02"] = 1,["thtd_seiga_03"] = 0},
		[2] = {["thtd_seiga_01"] = 1,["thtd_seiga_02"] = 2,["thtd_seiga_03"] = 0},
		[3] = {["thtd_seiga_01"] = 1,["thtd_seiga_02"] = 3,["thtd_seiga_03"] = 0},
		[4] = {["thtd_seiga_01"] = 1,["thtd_seiga_02"] = 4,["thtd_seiga_03"] = 1},
		[5] = {["thtd_seiga_01"] = 1,["thtd_seiga_02"] = 5,["thtd_seiga_03"] = 1},
	},

	["keine"] = {
		[1] = {["thtd_keine_01"] = 1,["thtd_keine_02"] = 1,["thtd_keine_03"] = 0,["thtd_keine_04"] = 0},
		[2] = {["thtd_keine_01"] = 1,["thtd_keine_02"] = 1,["thtd_keine_03"] = 0,["thtd_keine_04"] = 0},
		[3] = {["thtd_keine_01"] = 1,["thtd_keine_02"] = 1,["thtd_keine_03"] = 1,["thtd_keine_04"] = 0},
		[4] = {["thtd_keine_01"] = 1,["thtd_keine_02"] = 1,["thtd_keine_03"] = 1,["thtd_keine_04"] = 1},
		[5] = {["thtd_keine_01"] = 1,["thtd_keine_02"] = 1,["thtd_keine_03"] = 1,["thtd_keine_04"] = 1},
	},

	["medicine"] = {
		[1] = {["thtd_medicine_01"] = 1,["thtd_medicine_02"] = 0},
		[2] = {["thtd_medicine_01"] = 2,["thtd_medicine_02"] = 0},
		[3] = {["thtd_medicine_01"] = 3,["thtd_medicine_02"] = 1},
		[4] = {["thtd_medicine_01"] = 4,["thtd_medicine_02"] = 1},
		[5] = {["thtd_medicine_01"] = 5,["thtd_medicine_02"] = 1},
	},

	["luna"] = {
		[1] = {["thtd_luna_01"] = 1,["thtd_luna_02"] = 0},
		[2] = {["thtd_luna_01"] = 1,["thtd_luna_02"] = 0},
		[3] = {["thtd_luna_01"] = 1,["thtd_luna_02"] = 1},
		[4] = {["thtd_luna_01"] = 1,["thtd_luna_02"] = 1},
		[5] = {["thtd_luna_01"] = 1,["thtd_luna_02"] = 1},
	},

	["sunny"] = {
		[1] = {["thtd_sunny_01"] = 1,["thtd_sunny_02"] = 0},
		[2] = {["thtd_sunny_01"] = 1,["thtd_sunny_02"] = 0},
		[3] = {["thtd_sunny_01"] = 1,["thtd_sunny_02"] = 1},
		[4] = {["thtd_sunny_01"] = 1,["thtd_sunny_02"] = 1},
		[5] = {["thtd_sunny_01"] = 1,["thtd_sunny_02"] = 1},
	},

	["star"] = {
		[1] = {["thtd_star_01"] = 1,["thtd_star_02"] = 0},
		[2] = {["thtd_star_01"] = 2,["thtd_star_02"] = 0},
		[3] = {["thtd_star_01"] = 3,["thtd_star_02"] = 1},
		[4] = {["thtd_star_01"] = 4,["thtd_star_02"] = 1},
		[5] = {["thtd_star_01"] = 5,["thtd_star_02"] = 1},
	},

	["yuugi"] = {
		[1] = {["thtd_yuugi_01"] = 1,["thtd_yuugi_02"] = 0,["thtd_yuugi_03"] = 0},
		[2] = {["thtd_yuugi_01"] = 1,["thtd_yuugi_02"] = 0,["thtd_yuugi_03"] = 0},
		[3] = {["thtd_yuugi_01"] = 1,["thtd_yuugi_02"] = 1,["thtd_yuugi_03"] = 0},
		[4] = {["thtd_yuugi_01"] = 1,["thtd_yuugi_02"] = 1,["thtd_yuugi_03"] = 1},
		[5] = {["thtd_yuugi_01"] = 1,["thtd_yuugi_02"] = 1,["thtd_yuugi_03"] = 1},
	},

	["suika"] = {
		[1] = {["thtd_suika_01"] = 1,["thtd_suika_02"] = 1,["thtd_suika_03"] = 0,["thtd_suika_04"] = 0},
		[2] = {["thtd_suika_01"] = 2,["thtd_suika_02"] = 1,["thtd_suika_03"] = 0,["thtd_suika_04"] = 0},
		[3] = {["thtd_suika_01"] = 3,["thtd_suika_02"] = 1,["thtd_suika_03"] = 1,["thtd_suika_04"] = 0},
		[4] = {["thtd_suika_01"] = 4,["thtd_suika_02"] = 1,["thtd_suika_03"] = 1,["thtd_suika_04"] = 1},
		[5] = {["thtd_suika_01"] = 5,["thtd_suika_02"] = 1,["thtd_suika_03"] = 1,["thtd_suika_04"] = 1},
	},

	["junko"] = 
	{		
		[1] = {["thtd_junko_01"] = 1,["thtd_junko_02"] = 1,["thtd_junko_03"] = 0,["thtd_junko_04"] = 0},
		[2] = {["thtd_junko_01"] = 1,["thtd_junko_02"] = 1,["thtd_junko_03"] = 0,["thtd_junko_04"] = 0},
		[3] = {["thtd_junko_01"] = 1,["thtd_junko_02"] = 1,["thtd_junko_03"] = 1,["thtd_junko_04"] = 0},
		[4] = {["thtd_junko_01"] = 1,["thtd_junko_02"] = 1,["thtd_junko_03"] = 1,["thtd_junko_04"] = 0},
		[5] = {["thtd_junko_01"] = 1,["thtd_junko_02"] = 1,["thtd_junko_03"] = 1,["thtd_junko_04"] = 1},
	},

	["hecatia"] = 
	{
		[1] = {["thtd_hecatia_01"] = 1,["thtd_hecatia_02"] = 1,["thtd_hecatia_03"] = 1,["thtd_hecatia_04"] = 1},
		[2] = {["thtd_hecatia_01"] = 1,["thtd_hecatia_02"] = 1,["thtd_hecatia_03"] = 1,["thtd_hecatia_04"] = 1},
		[3] = {["thtd_hecatia_01"] = 1,["thtd_hecatia_02"] = 1,["thtd_hecatia_03"] = 1,["thtd_hecatia_04"] = 1},
		[4] = {["thtd_hecatia_01"] = 1,["thtd_hecatia_02"] = 1,["thtd_hecatia_03"] = 1,["thtd_hecatia_04"] = 1},
		[5] = {["thtd_hecatia_01"] = 1,["thtd_hecatia_02"] = 1,["thtd_hecatia_03"] = 1,["thtd_hecatia_04"] = 1},
	},

	["alice"] = 
	{
		[1] = {["thtd_alice_01"] = 1,["thtd_alice_02"] = 1,["thtd_alice_03"] = 0},
		[2] = {["thtd_alice_01"] = 2,["thtd_alice_02"] = 1,["thtd_alice_03"] = 0},
		[3] = {["thtd_alice_01"] = 3,["thtd_alice_02"] = 1,["thtd_alice_03"] = 0},
		[4] = {["thtd_alice_01"] = 4,["thtd_alice_02"] = 1,["thtd_alice_03"] = 1},
		[5] = {["thtd_alice_01"] = 5,["thtd_alice_02"] = 1,["thtd_alice_03"] = 1},
	},

	["kokoro"] = 
	{
		[1] = {["thtd_kokoro_01"] = 1,["thtd_kokoro_02"] = 1,["thtd_kokoro_03"] = 1,["thtd_kokoro_04"] = 0},
		[2] = {["thtd_kokoro_01"] = 2,["thtd_kokoro_02"] = 2,["thtd_kokoro_03"] = 1,["thtd_kokoro_04"] = 0},
		[3] = {["thtd_kokoro_01"] = 3,["thtd_kokoro_02"] = 3,["thtd_kokoro_03"] = 1,["thtd_kokoro_04"] = 0},
		[4] = {["thtd_kokoro_01"] = 4,["thtd_kokoro_02"] = 4,["thtd_kokoro_03"] = 1,["thtd_kokoro_04"] = 0},
		[5] = {["thtd_kokoro_01"] = 5,["thtd_kokoro_02"] = 5,["thtd_kokoro_03"] = 1,["thtd_kokoro_04"] = 1},
	},

	["hina"] = {
		[1] = {["thtd_hina_01"] = 1,["thtd_hina_02"] = 0},
		[2] = {["thtd_hina_01"] = 2,["thtd_hina_02"] = 0},
		[3] = {["thtd_hina_01"] = 3,["thtd_hina_02"] = 0},
		[4] = {["thtd_hina_01"] = 4,["thtd_hina_02"] = 1},
		[5] = {["thtd_hina_01"] = 5,["thtd_hina_02"] = 1},
	},

	["kagerou"] = 
	{
		[1] = {["lycan_feral_impulse"] = 1,["sven_great_cleave"] = 1,["lycan_howl"] = 0,["lycan_shapeshift"] = 0},
		[2] = {["lycan_feral_impulse"] = 2,["sven_great_cleave"] = 2,["lycan_howl"] = 1,["lycan_shapeshift"] = 0},
		[3] = {["lycan_feral_impulse"] = 3,["sven_great_cleave"] = 3,["lycan_howl"] = 2,["lycan_shapeshift"] = 1},
		[4] = {["lycan_feral_impulse"] = 4,["sven_great_cleave"] = 4,["lycan_howl"] = 3,["lycan_shapeshift"] = 2},
		[5] = {["lycan_feral_impulse"] = 4,["sven_great_cleave"] = 4,["lycan_howl"] = 4,["lycan_shapeshift"] = 3},
	},

	["wriggle"] = 
	{
		[1] = {["death_prophet_exorcism"] = 1, ["keeper_of_the_light_will_o_wisp"] = 0},
		[2] = {["death_prophet_exorcism"] = 2, ["keeper_of_the_light_will_o_wisp"] = 0},
		[3] = {["death_prophet_exorcism"] = 3, ["keeper_of_the_light_will_o_wisp"] = 1},
		[4] = {["death_prophet_exorcism"] = 4, ["keeper_of_the_light_will_o_wisp"] = 2},
		[5] = {["death_prophet_exorcism"] = 5, ["keeper_of_the_light_will_o_wisp"] = 3},
	},

	["inaba"] = 
	{
		[1] = {["sniper_headshot"] = 1, ["ogre_magi_bloodlust"] = 0},
		[2] = {["sniper_headshot"] = 2, ["ogre_magi_bloodlust"] = 1},
		[3] = {["sniper_headshot"] = 3, ["ogre_magi_bloodlust"] = 2},
		[4] = {["sniper_headshot"] = 4, ["ogre_magi_bloodlust"] = 3},
		[5] = {["sniper_headshot"] = 5, ["ogre_magi_bloodlust"] = 4},
	},

}		

thtd_combo_table = 
{
	["letty_cirno"] = {"cirno","letty"},
	["lyrica_lunasa_merlin"] = {"lyrica","lunasa","merlin"},
	["tenshi_iku"] = {"tenshi","iku"},
	["yuyuko_youmu"] = {"youmu","yuyuko"},
	["youmu_reisen"] = {"youmu","reisen"},
	["utsuho_rin"] = {"utsuho","rin"},
	["reimu_marisa"] = {"reimu","marisa"},
	["marisa_alice"] = {"marisa","alice"},
	["koishi_satori"] = {"koishi","satori"},
	["remilia_sakuya"] = {"remilia","sakuya"},
	["remilia_flandre"] = {"remilia","flandre"},
	["meirin_sakuya"] = {"meirin","sakuya"},
	["reimu_yukari"] = {"reimu","yukari"},
	["reimu_alice"] = {"reimu","alice"},	
	["koakuma_patchouli"] = {"koakuma","patchouli"},
	["chen_yukari_ran"] = {"chen","yukari","ran"},
	["eirin_kaguya"] = {"eirin","kaguya"},
	["rumia_reimu"] = {"rumia","reimu"},
	["suwako_kanako_sanae"] = {"suwako","kanako","sanae"},
	["nue_minamitsu"] = {"minamitsu","nue"},
	["futo_soga"] = {"futo","soga"},
	["yoshika_seiga"] = {"yoshika","seiga"},
	["mokou_keine"] = {"mokou","keine"},
	["luna_star_sunny"] = {"luna","star","sunny"},
}

thtd_ability_minoriko_star_up_table = 
{
	[2] = 202,
	[3] = 405,
	[4] = 675,
	[5] = 945,
}

thtd_ability_sizuha_star_up_table = 
{

	[2] = 162,
	[3] = 324,
	[4] = 540,
	[5] = 756,
}

thtd_nazrin_star_bouns =
{
	[1] = 0.02,
	[2] = 0.02,
	[3] = 0.02,
	[4] = 0.02,
	[5] = 0.02,
}

thtd_nazrin_star_bouns_constant =
{
	[1] = 3,
	[2] = 11,
	[3] = 27,
	[4] = 54,
	[5] = 214,
}

thtd_lily_star_bouns =
{
	[1] = 1,
	[2] = 1.8,
	[3] = 2.4,
	[4] = 3.2,
	[5] = 4,
}

thtd_spell_lock  = {
	[0] = {	},
	[1] = {	},
	[2] = {	},
	[3] = {	},
}

THTD_MAX_LEVEL = 10
THTD_MAX_FOOD = 12


function CDOTA_BaseNPC:THTD_InitExp()

	if self:GetUnitName() == "minoriko" or self:GetUnitName() == "sizuha" then

		self.thtd_level = THTD_MAX_LEVEL	
		if GameRules:GetCustomGameDifficulty() == 8 and self:GetUnitName() == "minoriko" then 	
			self.thtd_star = 3
		else
			self.thtd_star = 1
		end
		self.thtd_power = 1
		self.thtd_tower_damage = 0
		self.thtd_is_ex = false
		self.thtd_close_ai = false
		self.thtd_istower = true
		self.thtd_isChanged = false
		self.thtd_exp = thtd_exp_table[THTD_MAX_LEVEL - 1]
		self.thtd_mana_regen = self:GetManaRegen()
		self.thtd_mana_regen_percentage = 0
		self.thtd_crit_chance = 0

		self:THTD_OpenAbility()
		self:THTD_CreateLevelEffect()
		self:SetHasInventory(true)

		self.equip_bonus_table = 
		{
			["attack_percentage"] = 0,
			["mana_regen_percentage"] = 0,
			["crit_chance"] = 0,
			["crit_damage"] = 0,
			["physical_penetration_percentage"] = 0,
			["magical_penetration_percentage"] = 0,
			["power_percentage"] = 0,
			["magical_damage_percentage"] = 0,
			["physical_damage_percentage"] = 0,
			["damage_percentage"] = 0,
			["cooldown"] = 0,
			["attack_speed"] = 0,
			["power"] = 0,
		}

		if GameRules:GetCustomGameDifficulty() == 8 then return end

		local time_count = 0

		self:SetContextThink(DoUniqueString("thtd_minoriko_star_up_listen"), 
			function()
				if GameRules:IsGamePaused() then return 0.03 end
				if self:THTD_IsHidden() then return 1.0 end
				if self == nil or self:IsNull() or self:IsAlive() == false then return nil end
				if SpawnSystem.IsUnLimited then return nil end
				if self.thtd_star < 5 then					
					time_count = time_count + 1 * (self:FindAbilityByName("ability_common_star_up_speed"):GetSpecialValueFor("speed_tooltips") / 100 + 1 )
					if self.thtd_isChanged == true then
						time_count = 0
						self.thtd_isChanged = false
					end
					
					if self:GetUnitName() == "minoriko" then
						SendOverheadEventMessage(self:GetPlayerOwner(), OVERHEAD_ALERT_OUTGOING_DAMAGE, self, thtd_ability_minoriko_star_up_table[self.thtd_star+1] - time_count, self:GetPlayerOwner() )
						if time_count >= thtd_ability_minoriko_star_up_table[self.thtd_star+1] then
							self.thtd_star = self.thtd_star + 1
							self:THTD_OpenAbility()
							self:THTD_DestroyLevelEffect()
							self:THTD_CreateLevelEffect()
							time_count = 0						
							if self.thtd_star == 5 then								
								EmitSoundOnClient(THTD_GetVoiceEvent(self:GetUnitName(),"spawn"),self:GetPlayerOwner())
								CustomGameEventManager:Send_ServerToPlayer(self:GetPlayerOwner() , "show_message", {msg="minoriko_up_to_5_star", duration=30, params={}, color="#ff0"} )
							end
						end
					else
						SendOverheadEventMessage(self:GetPlayerOwner(), OVERHEAD_ALERT_OUTGOING_DAMAGE, self, thtd_ability_sizuha_star_up_table[self.thtd_star+1] - time_count, self:GetPlayerOwner() )
						if time_count >= thtd_ability_sizuha_star_up_table[self.thtd_star+1] then
							self.thtd_star = self.thtd_star + 1
							self:THTD_OpenAbility()
							self:THTD_DestroyLevelEffect()
							self:THTD_CreateLevelEffect()
							time_count = 0							
							if self.thtd_star == 5 then								
								EmitSoundOnClient(THTD_GetVoiceEvent(self:GetUnitName(),"spawn"),self:GetPlayerOwner())
								CustomGameEventManager:Send_ServerToPlayer( self:GetPlayerOwner() , "show_message", {msg="sizuha_up_to_5_star", duration=30, params={}, color="#ff0"} )
							end
						end
					end
					if self:THTD_IsHidden() then
						time_count = 0
					end
				end
				return 1.0
			end, 
		1.0)		

		return
	end


	self.thtd_exp = 0
	self.thtd_level = 1
	self.thtd_star = 1
	self.thtd_tower_damage = 0
	self.thtd_is_ex = false
	self.thtd_close_ai = false
	self.thtd_mana_regen = self:GetManaRegen()
	self.thtd_mana_regen_percentage = 0
	self.thtd_crit_chance = 0

	self.thtd_power = thtd_power_table[self:GetUnitName()][self.thtd_star][1]
	self.thtd_attack = thtd_attack_table[self:GetUnitName()][self.thtd_star][1]
	self.thtd_istower = true
	self:THTD_CreateLevelEffect()
	self:SetHasInventory(true)
	self:THTD_OpenAbility()

	self.equip_bonus_table = 
	{
		["attack_percentage"] = 0,
		["mana_regen_percentage"] = 0,
		["crit_chance"] = 0,
		["crit_damage"] = 0,
		["physical_penetration_percentage"] = 0,
		["magical_penetration_percentage"] = 0,
		["power_percentage"] = 0,
		["magical_damage_percentage"] = 0,
		["physical_damage_percentage"] = 0,
		["damage_percentage"] = 0,
		["cooldown"] = 0,
		["attack_speed"] = 0,
		["power"] = 0,
	}			
end

function CDOTA_BaseNPC:THTD_HeroComboRefresh()
	local hero = THTD_GetHero(self)
    if hero == nil then return end

	for index,tower in pairs(hero.thtd_hero_tower_list) do
		if THTD_IsValid(tower) then
			local combo = THTD_GetCombo(tower)
			local func = tower["THTD_"..tower:GetUnitName().."_thtd_combo"]
			if func then
				local changeCombo = func(tower,combo)
				if changeCombo ~= nil and #changeCombo > 0 then
					for k,v in pairs(changeCombo) do	
						v["unit"] = tower
						local exist = false
						for k2,v2 in pairs(hero.thtd_combo_voice_array) do
							if v2 == v then 
								exist = true
								break
							end
						end
						if exist == false then 
							table.insert(hero.thtd_combo_voice_array, v)
						end							
					end	
					changeCombo = {}									
				end
			end	
		end
	end	

	hero:SetContextThink(DoUniqueString("thtd_combo_voice_array"), 
		function()
			if hero.is_game_over == true then return nil end	
			if hero.thtd_combo_voice_array == nil or #hero.thtd_combo_voice_array == 0 then
				hero.sound_lock = nil 
				return nil 
			end

			for k,v in pairs(hero.thtd_combo_voice_array) do
				if v~=nil and v["comboName"] == "lyrica_lunasa_merlin" then
					if v["unit"]~=nil and v["unit"]:IsNull()==false then
						EmitSoundOn(THTD_GetVoiceEvent(v["unit"]:GetUnitName(),"combo."..v["comboName"]),v["unit"])
						table.remove(hero.thtd_combo_voice_array,k)
					end
				elseif v~=nil and hero.sound_lock == nil then
					hero.sound_lock = true
					hero:SetContextThink(DoUniqueString("wait_voice_play_end"), 
						function()							
							hero.sound_lock = false
							return nil
						end,
					v["delay"]+0.5)
				elseif v~=nil and hero.sound_lock == false then
					hero.sound_lock = true
					if v["unit"]~=nil and v["unit"]:IsNull()==false then						
						EmitSoundOn(THTD_GetVoiceEvent(v["unit"]:GetUnitName(),"combo."..v["comboName"]),v["unit"])
					end
					hero:SetContextThink(DoUniqueString("wait_voice_play_end"), 
						function()							
							hero.sound_lock = false
							table.remove(hero.thtd_combo_voice_array,k)
							return nil
						end,
					v["duration"]+0.5)
				end
			end
			return 0.5
		end,
	0)
end

function THTD_GetCombo(tower)
	local comboTable = {}
	for index,value in pairs(thtd_combo_table) do
		local count = 0
		local isInCombo = false

		for k,v in pairs(value) do
			if THTD_IsTowerInList(tower:GetOwner(),v) == true then
				count = count + 1
			end
			if tower:GetUnitName() == v then
				isInCombo = true
			end
		end
		if count == #value and isInCombo == true then
			comboTable[index] = value
		end
	end

	if comboTable ~= nil then
		return comboTable
	end
	return nil
end

function THTD_IsTowerInList(hero,towername)
	for k,v in pairs(hero.thtd_hero_tower_list) do
		if v~=nil and v:IsNull() == false then
			if v:GetUnitName() == towername then
				return true
			end
		end
	end
	return false
end

function CDOTA_BaseNPC:THTD_AddCritChance(chance)
	if self.thtd_crit_chance == nil then return end
	self.thtd_crit_chance = self.thtd_crit_chance + chance
end

local thtd_attack_speed_black_list = 
{
	"nazrin",
	"iku"
}

function CDOTA_BaseNPC:IsInAttackSpeedBlackList()
	for k,v in pairs(thtd_attack_speed_black_list) do
		if self:GetUnitName() == v then
			return true
		end
	end
	return false
end

function CDOTA_BaseNPC:THTD_RefreshAttackSpeed()
	if self == nil or self:IsNull() == false and self:IsAlive() then
		if self:IsInAttackSpeedBlackList() then
			return
		end
		local modifier = self:FindModifierByName("modifier_attack_speed")
		if modifier ~= nil then
			modifier:SetStackCount(self.equip_bonus_table["attack_speed"])
		else
			modifier = self:AddNewModifier(self, nil, "modifier_attack_speed", {})
			modifier:SetStackCount(self.equip_bonus_table["attack_speed"])
		end
	end
end

local thtd_cooldown_black_list = 
{
	"daiyousei",
	"toramaru",
}

function CDOTA_BaseNPC:IsInCooldownBlackList()
	for k,v in pairs(thtd_cooldown_black_list) do
		if self:GetUnitName() == v then
			return true
		end
	end
	return false
end

function CDOTA_BaseNPC:THTD_RefreshCooldown()
	if self == nil or self:IsNull() == false and self:IsAlive() then
		if self:IsInCooldownBlackList() then
			return
		end

		local modifier = self:FindModifierByName("modifier_cooldown_reduce")
		if modifier ~= nil then
			modifier:SetStackCount(self.equip_bonus_table["cooldown"])
		else
			modifier = self:AddNewModifier(self, nil, "modifier_cooldown_reduce", {})
			modifier:SetStackCount(self.equip_bonus_table["cooldown"])
		end
	end
end

local thtd_mana_regen_black_list = 
{
	"lily",
}

function CDOTA_BaseNPC:IsInManaRegenBlackList()
	for k,v in pairs(thtd_mana_regen_black_list) do
		if self:GetUnitName() == v then
			return true
		end
	end
	return false
end

function CDOTA_BaseNPC:THTD_RefreshManaRegen()
	if self:IsInManaRegenBlackList() then
		return
	end
	local totalPercentage = self.equip_bonus_table["mana_regen_percentage"] + self.thtd_mana_regen_percentage

 	if math.abs(self:GetManaRegen() - self.thtd_mana_regen * (1 + totalPercentage/100) ) > 0.1 then
		self:SetBaseManaRegen( self.thtd_mana_regen * (1 + totalPercentage/100) )
	end
end

function CDOTA_BaseNPC:THTD_GetExp()
	return self.thtd_exp
end

function CDOTA_BaseNPC:THTD_AddExp(exp)		
	self.thtd_exp = self.thtd_exp + exp * thtd_exp_star_table[self.thtd_star]
	self:THTD_ExpToLevelUp()
end

function CDOTA_BaseNPC:THTD_ExpToLevelUp()
	if self:THTD_GetLevel() < THTD_MAX_LEVEL then
		if self.thtd_exp >= thtd_exp_table[self.thtd_level] then
			if self.thtd_exp >= thtd_exp_table[THTD_MAX_LEVEL-1] then
				self:THTD_SetLevel(THTD_MAX_LEVEL)
				self.thtd_exp = thtd_exp_table[THTD_MAX_LEVEL-1] + 1
				return
			end
			for i=self.thtd_level,(THTD_MAX_LEVEL-1) do
				if self.thtd_exp < thtd_exp_table[i] then
					self:THTD_SetLevel(i)
					return
				end
			end
		end
	end	
end

function CDOTA_BaseNPC:THTD_SetLevel(level)
	local oldLevel = self.thtd_level
	local upLevel = math.min(level, THTD_MAX_LEVEL) - oldLevel
	self.thtd_level = oldLevel + upLevel

	local unitName = self:GetUnitName()
	if self:THTD_IsTowerEx() == true then
		unitName = unitName.."_ex"
	end

	if thtd_power_table[unitName] ~= nil and thtd_power_table[unitName][self.thtd_star] ~= nil then
		self:THTD_AddPower(thtd_power_table[unitName][self.thtd_star][2] * upLevel)
	end

	if SpawnSystem.IsUnLimited == false and upLevel > 0 and self:HasModifier("modifier_shinki_02_power_up_bonus_buff") then
		if self.thtd_shinki_02_power_up_bonus_count == nil then 
			self.thtd_shinki_02_power_up_bonus_count = (oldLevel - 1) + (self.thtd_star - 1) * (THTD_MAX_LEVEL - 1)
		end
		if self.thtd_shinki_02_power_up_bonus_count < 45 then
			local bonusLevel = math.min(45 - self.thtd_shinki_02_power_up_bonus_count, upLevel)
			if self:GetUnitName() == "shinki" then
				self:THTD_AddPower(5*2*bonusLevel)
			else
				self:THTD_AddPower(self:THTD_GetShinkiMaxStar()*2*bonusLevel)
			end
			self.thtd_shinki_02_power_up_bonus_count = self.thtd_shinki_02_power_up_bonus_count + bonusLevel
		end	
	end

	if thtd_attack_table[unitName]~=nil then
		self:THTD_AddAttack(thtd_attack_table[unitName][self.thtd_star][2]*upLevel)
	end
	local effectIndex = ParticleManager:CreateParticle("particles/econ/events/ti6/hero_levelup_ti6_godray.vpcf", PATTACH_CUSTOMORIGIN, self)
	ParticleManager:SetParticleControl(effectIndex, 0, self:GetOrigin())
	ParticleManager:DestroyParticleSystem(effectIndex,false)

	self:EmitSound("Sound_THTD.thtd_level_up")

	self:THTD_DestroyLevelEffect()
	self:THTD_CreateLevelEffect()
end

function CDOTA_BaseNPC:THTD_LevelUp(level)		
	local oldLevel = self.thtd_level
	local upLevel = math.min(level, THTD_MAX_LEVEL - oldLevel)
	self.thtd_level = oldLevel + upLevel

	local unitName = self:GetUnitName()
	if self:THTD_IsTowerEx() == true then
		unitName = unitName.."_ex"
	end

	if thtd_power_table[unitName] ~= nil and thtd_power_table[unitName][self.thtd_star] ~= nil then
		self:THTD_AddPower(thtd_power_table[unitName][self.thtd_star][2]*upLevel)
	end

	if SpawnSystem.IsUnLimited == false and upLevel > 0 and self:HasModifier("modifier_shinki_02_power_up_bonus_buff") then
		if self.thtd_shinki_02_power_up_bonus_count == nil then 
			self.thtd_shinki_02_power_up_bonus_count = (oldLevel - 1) + (self.thtd_star - 1) * (THTD_MAX_LEVEL - 1)
		end
		if self.thtd_shinki_02_power_up_bonus_count < 45 then
			local bonusLevel = math.min(45 - self.thtd_shinki_02_power_up_bonus_count, upLevel)
			if self:GetUnitName() == "shinki" then
				self:THTD_AddPower(5*2*bonusLevel)
			else
				self:THTD_AddPower(self:THTD_GetShinkiMaxStar()*2*bonusLevel)
			end
			self.thtd_shinki_02_power_up_bonus_count = self.thtd_shinki_02_power_up_bonus_count + bonusLevel
		end	
	end

	if thtd_attack_table[unitName]~=nil then
		self:THTD_AddAttack(thtd_attack_table[unitName][self.thtd_star][2]*upLevel)
	end

	local effectIndex = ParticleManager:CreateParticle("particles/econ/events/ti6/hero_levelup_ti6_godray.vpcf", PATTACH_CUSTOMORIGIN, self)
	ParticleManager:SetParticleControl(effectIndex, 0, self:GetOrigin())
	ParticleManager:DestroyParticleSystem(effectIndex,false)

	self:THTD_DestroyLevelEffect()
	self:THTD_CreateLevelEffect()
end

function CDOTA_BaseNPC:THTD_GetShinkiMaxStar()
	local hero = THTD_GetHero(self)
	if hero == nil then return 0 end
	
	local star = 0
	for k,v in pairs(hero.thtd_hero_tower_list) do
		if v:GetUnitName() == "shinki" then 
			if star < v:THTD_GetStar() then 
				star = v:THTD_GetStar()
			end
		end	
	end
	return star
end

function CDOTA_BaseNPC:THTD_GetLevel()
	return self.thtd_level
end

function CDOTA_BaseNPC:THTD_GetStar()
	return self.thtd_star
end

function CDOTA_BaseNPC:THTD_SetStar(star)
	local lastPower = nil
	local lastAttack = nil

	local unitName = self:GetUnitName()
	if self:THTD_IsTowerEx() == true then
		unitName = unitName.."_ex"
	end

	if thtd_power_table[unitName] ~= nil and thtd_power_table[unitName][self.thtd_star] ~= nil then
		lastPower = thtd_power_table[unitName][self.thtd_star][1] + thtd_power_table[unitName][self.thtd_star][2] * (self:THTD_GetLevel()-1)
	end
	if thtd_attack_table[unitName] ~= nil and thtd_attack_table[unitName][self.thtd_star] ~= nil then
		lastAttack = thtd_attack_table[unitName][self.thtd_star][1] + thtd_attack_table[unitName][self.thtd_star][2] * (self:THTD_GetLevel()-1)
	end

	self.thtd_star = star
	self.thtd_level = 1
	self.thtd_exp = 0

	if thtd_power_table[unitName] ~= nil and thtd_power_table[unitName][self.thtd_star] ~= nil then
		if lastPower~=nil then
			self.thtd_power = self.thtd_power + thtd_power_table[unitName][self.thtd_star][1] - lastPower
		else
			self.thtd_power = self.thtd_power + thtd_power_table[unitName][self.thtd_star][1]
		end
	end

	if thtd_attack_table[unitName] ~= nil and thtd_attack_table[unitName][self.thtd_star] ~= nil then
		if lastAttack~=nil then
			self.thtd_attack = self.thtd_attack + thtd_attack_table[unitName][self.thtd_star][1] - lastAttack
		end
	end

	self:THTD_DestroyLevelEffect()
	self:THTD_CreateLevelEffect()
	self:SetMana(0)
	self:THTD_OpenAbility()
	self:EmitSound("Sound_THTD.thtd_star_up")

	local effectIndex = ParticleManager:CreateParticle("particles/heroes/byakuren/ability_byakuren_02.vpcf", PATTACH_CUSTOMORIGIN, self)
	ParticleManager:SetParticleControl(effectIndex, 0, self:GetOrigin())
	ParticleManager:SetParticleControl(effectIndex, 1, self:GetOrigin())
	ParticleManager:DestroyParticleSystem(effectIndex,false)

	self:THTD_HeroComboRefresh()
end

function CDOTA_BaseNPC:THTD_UpgradeStar()
	local lastPower = nil
	local lastAttack = nil

	local unitName = self:GetUnitName()
	if self:THTD_IsTowerEx() == true then
		unitName = unitName.."_ex"
	end
	
	if thtd_power_table[unitName][self.thtd_star]~=nil then
		lastPower = thtd_power_table[unitName][self.thtd_star][1] + thtd_power_table[unitName][self.thtd_star][2] * (self:THTD_GetLevel()-1)
	end
	if thtd_attack_table[unitName]~=nil then
		lastAttack = thtd_attack_table[unitName][self.thtd_star][1] + thtd_attack_table[unitName][self.thtd_star][2] * (self:THTD_GetLevel()-1)
	end

	self.thtd_star = self.thtd_star + 1
	self.thtd_level = 1
	self.thtd_exp = 0

	if lastPower~=nil then
		self.thtd_power = self.thtd_power + thtd_power_table[unitName][self.thtd_star][1] - lastPower
	else
		self.thtd_power = self.thtd_power + thtd_power_table[unitName][self.thtd_star][1]
	end

	if lastAttack~=nil then
		self.thtd_attack = self.thtd_attack + thtd_attack_table[unitName][self.thtd_star][1] - lastAttack
	end

	self:THTD_DestroyLevelEffect()
	self:THTD_CreateLevelEffect()
	self:SetMana(0)
	self:THTD_OpenAbility()
	self:EmitSound("Sound_THTD.thtd_star_up")

	local effectIndex = ParticleManager:CreateParticle("particles/heroes/byakuren/ability_byakuren_02.vpcf", PATTACH_CUSTOMORIGIN, self)
	ParticleManager:SetParticleControl(effectIndex, 0, self:GetOrigin())
	ParticleManager:SetParticleControl(effectIndex, 1, self:GetOrigin())
	ParticleManager:DestroyParticleSystem(effectIndex,false)

	self:THTD_HeroComboRefresh()
end

	
function CDOTA_BaseNPC:THTD_GetPower()
	if self.thtd_power == nil and self.equip_bonus_table["power"] == nil then return 0 end

	local ability=self:FindAbilityByName("ability_common_power_buff")
	local level = 1

	if ability ~= nil then
		level = ability:GetLevel()
	end
	return math.floor((self.thtd_power + self.equip_bonus_table["power"]) * (1 + ((level - 1) *0.15)) * (1 + self.equip_bonus_table["power_percentage"]/100) + 0.5)
end

function CDOTA_BaseNPC:THTD_AddPower(power)
	self.thtd_power = math.floor(self.thtd_power + power + 0.5)
end

function CDOTA_BaseNPC:THTD_GetAttack()
	if self.thtd_attack == nil or self.equip_bonus_table["attack_percentage"] == nil then return 0 end
	local ability=self:FindAbilityByName("ability_common_power_buff")
	local level = 1

	if ability ~= nil then
		level = ability:GetLevel()
	end
	return math.floor(self.thtd_attack * (1 + ((level - 1) *0.2)) * (1 + self.equip_bonus_table["attack_percentage"]/100) + 0.5)
end

function CDOTA_BaseNPC:THTD_AddAttack(attack)
	self.thtd_attack = math.floor(self.thtd_attack + attack + 0.5)
end


function CDOTA_BaseNPC:THTD_CreateLevelEffect()
	if self.thtd_is_effect_open == true then return end
	self.thtd_level_effect = ParticleManager:CreateParticle("particles/thtd/msg/thtd_msg_level.vpcf", PATTACH_CUSTOMORIGIN, self)
	if self.thtd_level < 10 then
		ParticleManager:SetParticleControl(self.thtd_level_effect, 0, self:GetOrigin())
		ParticleManager:SetParticleControl(self.thtd_level_effect, 2, Vector(0,1,0))
		ParticleManager:SetParticleControl(self.thtd_level_effect, 3, Vector(0,self.thtd_level,0))
	else
		ParticleManager:SetParticleControl(self.thtd_level_effect, 0, self:GetOrigin())
		ParticleManager:SetParticleControl(self.thtd_level_effect, 2, Vector(0,2,0))
		ParticleManager:SetParticleControl(self.thtd_level_effect, 3, Vector(0,10,0))
	end

	self.thtd_star_effect = ParticleManager:CreateParticle("particles/thtd/msg/thtd_msg_star.vpcf", PATTACH_CUSTOMORIGIN, self)

	ParticleManager:SetParticleControl(self.thtd_star_effect, 0, self:GetOrigin())
	ParticleManager:SetParticleControl(self.thtd_star_effect, 2, Vector(0,self.thtd_star,0))
	ParticleManager:SetParticleControl(self.thtd_star_effect, 3, Vector(0,0,0))
	self.thtd_is_effect_open = true
end

function CDOTA_BaseNPC:THTD_DestroyLevelEffect()
	ParticleManager:DestroyParticleSystem(self.thtd_level_effect,true)
	ParticleManager:DestroyParticleSystem(self.thtd_star_effect,true)
	self.thtd_is_effect_open = false
end

local thtd_bonus_ability_table = 
{
	"ability_common_attack_speed_buff",
	"ability_common_power_buff",
	"ability_common_mana_regen_buff",
	"ability_common_decrease_armor_buff",
	"ability_common_decrease_magic_armor_buff",
	"ability_common_star_up_speed",
}

function CDOTA_BaseNPC:THTD_SetAbilityLevelUp()
	for k,v in pairs(thtd_bonus_ability_table) do
		local ability=self:FindAbilityByName(v)

		if ability ~= nil then
			if ability:GetLevel() < ability:GetMaxLevel() then
				ability:SetLevel(ability:GetLevel()+1)
			end
		end
	end
end

function CDOTA_BaseNPC:THTD_OpenAbility()
	local unitName = self:GetUnitName()
	if self:THTD_IsTowerEx() == true then
		unitName = unitName.."_ex"
	end
	for k,v in pairs(thtd_ability_table[unitName]) do
		for abilityName,level in pairs(v) do
			local ability=self:FindAbilityByName(abilityName)
			if self:THTD_GetStar() == k then
				if ability ~= nil and ability:GetLevel()~=level then
					if level < 1 then
						ability:SetActivated(false)						
					else
						ability:SetActivated(true)
					end
					ability:SetLevel(level)
				end
			end
		end
	end
end


function CDOTA_BaseNPC:THTD_IsTower()
	return self.thtd_istower or false
end

function CDOTA_BaseNPC:THTD_UpgradeEx()
	local unitName = self:GetUnitName()
	local star = self:THTD_GetStar()
	local level = self:THTD_GetLevel()

	for k,v in pairs(thtd_ability_table[unitName]) do
		for abilityName,level in pairs(v) do
			if self:THTD_GetStar() == k then
				self:RemoveAbility(abilityName)
			end
		end
	end
	unitName = self:GetUnitName().."_ex"

	for k,v in pairs(thtd_ability_table[unitName]) do
		for abilityName,level in pairs(v) do
			if self:THTD_GetStar() == k then
				local ability=self:AddAbility(abilityName)
				ability:SetLevel(level)
			end
		end
	end

	self:THTD_SetStar(1)
	self:THTD_SetLevel(1)
	self.thtd_is_ex = true
	self:THTD_SetStar(star)
	self:THTD_SetLevel(level)
end

function CDOTA_BaseNPC:THTD_IsTowerEx()
	return self.thtd_is_ex or false
end

function CDOTA_BaseNPC:THTD_GetFaith()
	local hero = self:GetOwner()
	if hero:GetUnitName() ~= "npc_dota_hero_lina" then return 0 end
	if hero.thtd_ss_faith == nil then hero.thtd_ss_faith = 0 end
	if self:HasModifier("modifier_thtd_ss_kill") then
		return hero.thtd_ss_faith
    end
    return 0
end

function CDOTA_BaseNPC:THTD_AddFaith(count)
	local hero = self:GetOwner()
	if hero:GetUnitName() ~= "npc_dota_hero_lina" then return end
	if count < 1 then return end

	if hero.thtd_ss_faith == nil then hero.thtd_ss_faith = 0 end
	local bonusCount = math.min(500-hero.thtd_ss_faith,count)
	hero.thtd_ss_faith = hero.thtd_ss_faith + bonusCount
	for k,v in pairs(hero.thtd_hero_tower_list) do
		if v:HasModifier("modifier_thtd_ss_kill") then
			local modifier = v:FindModifierByName("modifier_thtd_ss_faith")
			if modifier==nil then
				v:AddNewModifier(v, nil, "modifier_thtd_ss_faith", {})
			else
				modifier:SetStackCount(hero.thtd_ss_faith)
			end
		end
	end
end

local thtd_Unique_Slow_Buff = 
{
	"modifier_cirno_01_slow_buff",	
	"modifier_merlin_01_debuff",
	"modifier_satori_01_debuff",
	"modifier_thdots_ran02_debuff",
	"modifier_sanae_debuff",
	"modifier_minamitsu_01_slow_buff",	
	"modifier_yoshika_01_slow",
	"modifier_medicine_01_slow",
	"modifier_star_01_slow",
	"modifier_suika_01_slow_debuff",
	"modifier_hina_01_slow_debuff",
	"modifier_earthshock_debuff_datadriven",
}

function THTD_IsUniqueSlowBuff(modifierName)
	for index,name in pairs(thtd_Unique_Slow_Buff) do
		if name == modifierName then
			return true
		end
	end
	return false
end

function CDOTA_BaseNPC:THTD_HasUniqueSlowBuff()
	local modifiers = self:FindAllModifiers()
	local count = 0

	for k,v in pairs(modifiers) do
		for index,name in pairs(thtd_Unique_Slow_Buff) do
			if v:GetName() == name then
				count = count + 1
			end
		end
	end
	if count > 1 then
		return true
	end
	
	return false
end

function CDOTA_BaseNPC:THTD_IsHidden()
	if self:HasModifier("modifier_touhoutd_release_hidden") then
		return true
	end
	return false
end

local thtd_equip_table = 
{
	["item_2005"] = 
	{
		["single"] = 
		{
			["attack_percentage"] = 10,
		},
		["suit"] = 
		{
			[2] = {
				["attack_percentage"] = 30,
			},
			[4] = {
				["modifier"] = "modifier_item_2005_attack_aura",
			},
		},
	},
	["item_2006"] = 
	{
		["single"] = 
		{
			["mana_regen_percentage"] = 4,
		},
		["suit"] = 
		{
			[2] = {
				["mana_regen_percentage"] = 10,
			},
			[4] = {
				["modifier"] = "modifier_item_2006_mana_regen_aura",
			},
		},
	},
	["item_2007"] = 
	{
		["single"] = 
		{
			["mana_regen_percentage"] = 4,
		},
		["suit"] = 
		{
			[2] = {
				["mana_regen_percentage"] = 10,
			},
			[4] = {
				["modifier"] = "modifier_item_2008_slow_aura",
			},
		},
	},
	["item_2008"] = 
	{
		["single"] = 
		{
			["crit_chance"] = 5,
		},
		["suit"] = 
		{
			[2] = {
				["crit_chance"] = 10,
			},
			[4] = {
				["crit_damage"] = 100,
			},
		},
	},
	["item_2009"] = 
	{
		["single"] = 
		{
			["physical_penetration_percentage"] = 5,
		},
		["suit"] = 
		{
			[2] = {
				["physical_penetration_percentage"] = 10,
			},
			[4] = {
				["modifier"] = "modifier_item_2009_physical_penetration",
			},
		},
	},
	["item_2010"] = 
	{
		["single"] = 
		{
			["magical_penetration_percentage"] = 5,
		},
		["suit"] = 
		{
			[2] = {
				["magical_penetration_percentage"] = 10,
			},
			[4] = {
				["modifier"] = "modifier_item_2010_magical_penetration",
			},
		},
	},
	["item_2011"] = 
	{
		["single"] = 
		{
			["attack_percentage"] = 10,
			["power_percentage"] = 2,
		},
		["suit"] = 
		{
			[2] = {
				["attack_percentage"] = 15,
				["power_percentage"] = 6,
			},
			[4] = {
				["modifier"] = "modifier_item_2011_attack_stun",
			},
		},
	},
	["item_2012"] = 
	{
		["single"] = 
		{
			["magical_damage_percentage"] = 4,
		},
		["suit"] = 
		{
			[2] = {
				["magical_damage_percentage"] = 20,
			},
			[4] = {
				["modifier"] = "modifier_item_2012_magical_damage_aura",
			},
		},
	},
	["item_2013"] = 
	{
		["single"] = 
		{
			["physical_damage_percentage"] = 4,
		},
		["suit"] = 
		{
			[2] = {
				["physical_damage_percentage"] = 20,
			},
			[4] = {
				["modifier"] = "modifier_item_2013_physical_damage_aura",
			},
		},
	},
	["item_2014"] = 
	{
		["single"] = 
		{
			["damage_percentage"] = 3,
		},
		["suit"] = 
		{
			[2] = {
				["damage_percentage"] = 15,
			},
			[4] = {
				["modifier"] = "modifier_item_2014_damage_aura",
			},
		},
	},
	["item_2015"] = 
	{
		["single"] = 
		{
			["crit_chance"] = 5,
		},
		["suit"] = 
		{
			[2] = {
				["crit_chance"] = 10,
			},
			[4] = {
				["crit_chance"] = 25,
			},
		},
	},
	["item_2016"] = 
	{
		["single"] = 
		{
			["magical_damage_percentage"] = 2,
			["mana_regen_percentage"] = 2,
		},
		["suit"] = 
		{
			[2] = {
				["magical_damage_percentage"] = 10,
				["mana_regen_percentage"] = 5,
			},
			[4] = {
				["cooldown"] = 25,
			},
		},
	},
	["item_2017"] = 
	{
		["single"] = 
		{
			["attack_speed"] = 4,
		},
		["suit"] = 
		{
			[2] = {
				["attack_speed"] = 20,
			},
			[4] = {
				["attack_speed"] = 25,
			},
		},
	},
	["item_2018"] = 
	{
		["single"] = 
		{
			["attack_percentage"] = 5,
			["power_percentage"] = 2,
		},
		["suit"] = 
		{
			[2] = {
				["attack_percentage"] = 15,
				["power_percentage"] = 6,
			},
			[4] = {
				["modifier"] = "modifier_item_2018_bonus_attack_range",
			},
		},
	},
	["item_2019"] = 
	{
		["single"] = 
		{
			["power_percentage"] = 4,
		},
		["suit"] = 
		{
			[2] = {
				["power_percentage"] = 12,
			},
			[4] = {
				["power"] = 200,
			},
		},
	},
	["item_2020"] = 
	{
		["single"] = 
		{
			["power_percentage"] = 4,
		},
		["suit"] = 
		{
			[2] = {
				["power_percentage"] = 12,
			},
			[4] = {
				["modifier"] = "modifier_item_2020_damage",
			},
		},
	},
	["item_2025"] = 
	{
		["single"] = 
		{
			["power_percentage"] = 2,
			["magical_damage_percentage"] = 2,
		},
		["suit"] = 
		{
			[2] = {
				["power_percentage"] = 6,
				["magical_damage_percentage"] = 10,
			},
			[4] = {
				["modifier"] = "modifier_item_2025_damage",
			},
		},
	},
	["item_2026"] = 
	{
		["single"] = 
		{
			["power_percentage"] = 2,
			["physical_damage_percentage"] = 2,
		},
		["suit"] = 
		{
			[2] = {
				["power_percentage"] = 6,
				["physical_damage_percentage"] = 10,
			},
			[4] = {
				["modifier"] = "modifier_item_2026_damage",
			},
		},
	},
}

function CDOTA_BaseNPC:THTD_GetSelfItemCount(itemName)
	local count = 0
 	for i=0,5 do
		local targetItem = self:GetItemInSlot(i)
		if targetItem~=nil and targetItem:IsNull()==false then
			if targetItem:GetAbilityName() == itemName then
				count = count + 1
			end
		end
	end
	return count
end

function CDOTA_BaseNPC:THTD_EquipRefresh()
	local equip_bonus_table = 
	{
		["attack_percentage"] = 0,
		["mana_regen_percentage"] = 0,
		["crit_chance"] = 0,
		["crit_damage"] = 0,
		["physical_penetration_percentage"] = 0,
		["magical_penetration_percentage"] = 0,
		["power_percentage"] = 0,
		["magical_damage_percentage"] = 0,
		["physical_damage_percentage"] = 0,
		["damage_percentage"] = 0,
		["cooldown"] = 0,
		["attack_speed"] = 0,
		["power"] = 0,
	}

	local suitUnique = {}

 	for i=0,5 do
		local targetItem = self:GetItemInSlot(i)

		if targetItem~=nil and targetItem:IsNull()==false then
			for itemName,value in pairs(thtd_equip_table) do
				if targetItem:GetAbilityName() == itemName then
					if value["single"] ~= nil then
						for bonusName,bonus in pairs(value["single"]) do
							equip_bonus_table[bonusName] = equip_bonus_table[bonusName] + bonus
						end
					end


					if value["suit"] ~= nil and suitUnique[itemName] ~= true then
						suitUnique[itemName] = true

						if self:THTD_GetSelfItemCount(itemName) >= 2 then
							for bonusName,bonus in pairs(value["suit"][2]) do
								if bonusName ~= "modifier" then
									equip_bonus_table[bonusName] = equip_bonus_table[bonusName] + bonus
								else
									if self:HasModifier(bonus) == false then
										local modifier = self:AddNewModifier(self, nil, bonus, {})
										self:SetContextThink(DoUniqueString("thtd_remove_modifier"), 
											function()
												if GameRules:IsGamePaused() then return 0.03 end
												if self:THTD_GetSelfItemCount(itemName) < 2 then
													modifier:Destroy()
													return nil
												end
												return 1.0
											end,
										1.0)
									end
								end
							end
						end

						if self:THTD_GetSelfItemCount(itemName) >= 4 then
							for bonusName,bonus in pairs(value["suit"][4]) do
								if bonusName ~= "modifier" then
									equip_bonus_table[bonusName] = equip_bonus_table[bonusName] + bonus
								else
									if self:HasModifier(bonus) == false then
										self:AddNewModifier(self, nil, bonus, {})
										local modifier = self:AddNewModifier(self, nil, bonus, {})
										self:SetContextThink(DoUniqueString("thtd_remove_modifier"), 
											function()
												if GameRules:IsGamePaused() then return 0.03 end
												if self:THTD_GetSelfItemCount(itemName) < 4 then
													modifier:Destroy()
													return nil
												end
												return 1.0
											end,
										1.0)
									end
								end
							end
						end
					end


				end
			end
		end
	end

	for k,v in pairs(equip_bonus_table) do
		self.equip_bonus_table[k] = v
	end	

	equip_bonus_table = {}
	suitUnique = {}
	
	self:THTD_RefreshManaRegen()
	self:THTD_RefreshCooldown()
	self:THTD_RefreshAttackSpeed()
end

function CDOTA_BaseNPC:THTD_DropItemAll()
	for i=0,8 do
		local targetItem = self:GetItemInSlot(i)
		if targetItem~=nil and targetItem:IsNull()==false then				
			if self:GetUnitName() == "chen" or self:GetUnitName() == "aya" then									
				self:DropItemAtPositionImmediate(targetItem, self:GetOwner():GetOrigin())				
			else
				self:DropItemAtPositionImmediate(targetItem, self:GetOrigin())
			end				
		end
	end
end

function CDOTA_BaseNPC:THTD_AddCardPoolItem(itemName)
	if self:GetUnitName()~="npc_dota_hero_lina" or itemName==nil then return end

	local item = CreateItem(itemName, nil, nil)
	if item==nil then return end	
	item.card_poor_player_id = self.thtd_player_id
	item.owner_player_id = self.thtd_player_id
	self:AddItem(item)
	item:THTD_RemoveItemInList(self.thtd_player_id)				

	local cardName = item:THTD_GetCardName()
	if item:THTD_IsCardHasVoice() == true then
		local player = self:GetPlayerOwner()
		if player then
			EmitSoundOnClient(THTD_GetVoiceEvent(cardName,"spawn"),player)
		end
	end

	if item:THTD_IsCardHasPortrait() == true then
		local portraits= item:THTD_GetPortraitPath(cardName)
		local quality = item:THTD_GetCardQuality()
		if quality == 1 then
			local effectIndex = ParticleManager:CreateParticleForPlayer(portraits, PATTACH_WORLDORIGIN, self, self:GetPlayerOwner())
			ParticleManager:SetParticleControl(effectIndex, 0, Vector(-58,-80,0))
			ParticleManager:SetParticleControl(effectIndex, 1, Vector(80,0,0))
			ParticleManager:DestroyParticleSystemTime(effectIndex,6.0)
			self:EmitSound("Sound_THTD.thtd_draw_n")
		elseif quality == 2 then
			local effectIndex = ParticleManager:CreateParticleForPlayer(portraits, PATTACH_WORLDORIGIN, self, self:GetPlayerOwner())
			ParticleManager:SetParticleControl(effectIndex, 0, Vector(-58,-80,0))
			ParticleManager:SetParticleControl(effectIndex, 1, Vector(80,0,0))
			ParticleManager:DestroyParticleSystemTime(effectIndex,6.0)
			self:EmitSound("Sound_THTD.thtd_draw_r")
		elseif quality == 3 then
			local effectIndex = ParticleManager:CreateParticleForPlayer(portraits, PATTACH_WORLDORIGIN, self, self:GetPlayerOwner())
			ParticleManager:SetParticleControl(effectIndex, 0, Vector(-58,-80,0))
			ParticleManager:SetParticleControl(effectIndex, 1, Vector(80,0,0))
			ParticleManager:DestroyParticleSystemTime(effectIndex,6.0)
			self:EmitSound("Sound_THTD.thtd_draw_sr")
		elseif quality == 4 then
			local effectIndex = ParticleManager:CreateParticle(portraits, PATTACH_WORLDORIGIN, nil)
			ParticleManager:SetParticleControl(effectIndex, 0, Vector(-58,-80,0))
			ParticleManager:SetParticleControl(effectIndex, 1, Vector(80,0,0))
			ParticleManager:DestroyParticleSystemTime(effectIndex,6.0)
			effectIndex = ParticleManager:CreateParticle("particles/portraits/portraits_ssr_get_screen_effect.vpcf", PATTACH_WORLDORIGIN, nil)
			ParticleManager:DestroyParticleSystemTime(effectIndex,4.0)
			self:EmitSound("Sound_THTD.thtd_draw_ssr")
		end		
	end

end

local thtd_remain_buff = 
{
	"modifier_miko_02_buff",	
	"modifier_miko_02_ready",
	"modifier_byakuren_03_buff",
	"modifier_thtd_ss_kill",
	"modifier_sanae_04_buff",
	"modifier_thtd_ss_faith",
	"modifier_sakuya_02_buff",
	"modifier_suwako_04_buff",
	"modifier_yuuka_03_kill_count",	
}

function THTD_IsRemainBuff(modifierName)
	for index,name in pairs(thtd_remain_buff) do
		if name == modifierName then
			return true
		end
	end
	return false
end

function THTD_SetSpellLock(caster, abilityName, time)
	local id = caster:GetPlayerOwnerID()
	if thtd_spell_lock[id] == nil then thtd_spell_lock[id] = {} end
	thtd_spell_lock[id][abilityName] = GameRules:GetGameTime() + time  -- 有时实际时间要加一个AI运行间隔
	-- ability:GetCastPoint() --施法前摇
end

function THTD_IsSpellLock(caster, abilityName)	
	local id = caster:GetPlayerOwnerID()
	if thtd_spell_lock[id] == nil then thtd_spell_lock[id] = {} end
	if thtd_spell_lock[id][abilityName] ~= nil and thtd_spell_lock[id][abilityName] > GameRules:GetGameTime() then			
		return true
	else		
		return false
	end	
end

local thtd_lock_card_list = 
{
	"kagerou",
	"wriggle",
	"inaba",	
}

function THTD_IsLockedCard(cardname)
	for index,name in pairs(thtd_lock_card_list) do
		if name == cardname then
			return true
		end
	end
	return false
end
